brianreinhold/NordicPHDs/nRF52/ble_app_met_epoch/handleSpecializations.c
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "nrf_soc.h"

#include "ble_types.h"

#include "MetControlStructs.h"
#include "nomenclature.h"
#include "configMetEncoder.h"
#include "msmt_queue.h"
#include "handleSpecializations.h"
#include "btle_utils.h"

/**
 * We have put as much of the specialization configuration code in this file. The first method to
 * be invoked is the configureSpecializations. Here we create the groups and the measurements to
 * be included in the groups. We then create the data array for each of the groups. We no longer
 * need the structures that were used to create the data array and thus we free them. This happens
 * prior to any connection. Once connected, we call updateData* methods to enter measurement data
 * and other 'observational' information into the array.
 *
 * The next method to be called is generateAndAddStoredMsmt. This method is invoked by pressing the
 * DK button 4. It is also done prior to connection and only if we want to simulate stored data.
 * Fake data is generated by using the timer. Each specialization has its own structure which has the
 * data to be inserted into the data array once connections get going.
 *
 * Nothing will happen now until we press DK button 3 to start advertising. The first method to be called
 * in this file will be handleSpecializationsOnSetTime() and only if we support a settable time stamp.
 * This method updates the RTC clock and our current time structure. It also takes care of any date
 * time adjustments in the stored data if we have any.
 *
 * Next will be the sendStoredSpecializationMsmts if we have stored data. The stored structure is placed
 * into a queue. In the main loop, the stored structure is pulled from the queue and then the
 * encodeSpecializationMsmt is called. Now the send_data flag is set to true and back in the main 
 * loop the send_data method is called. The next stored data element will not be placed into the queue
 * until the previous one completes (all fragments sent and a record done sent to the gateway client).
 *
 * The same procedure happens once the live data is commanded. The difference is that we have a timer
 * that periodically triggers calls to generateLiveDataForSpecializations which does the same thing as
 * the generate stored data using the timestamp to make measurements. The structure is then queued and
 * the same thing as with the stored data happens. This will continue until the user presses DK button 2
 * to disconnect. 
 *
 * The Spirometer specializations does not support generation of stored data (to difficult to fake) and only
 * one set of preset values are sent live and that is it. The Glucose specialization supports no live data,
 * just stored as that is the typcial use case. That was just our choice. The other specializations support
 * both stored and live data, but one must press DK button 4 prior to starting advertising to create a stored
 * data entry...one entry for every button push. * 
 */
s_MetTime *sMetTime                             = NULL;
s_TimeInfo *sTimeInfo                           = NULL;
s_TimeInfoData *sTimeInfoData                   = NULL;
s_SystemInfo *systemInfo                        = NULL;     // We need to keep this for the BT_SIG option
s_SystemInfoData *systemInfoData                = NULL;
unsigned short pairing                          = SUPPORT_PAIRING;        // Value of 1 indicates that pairing/bonding is required.
unsigned char batteryCharValue                  = 0x63;
//unsigned short timeSync                         = 0x1F00;   // Unsynchronized
unsigned short numberOfStoredMsmtGroups         = 0;
bool stored_data_same                           = true;  // When true, we do not need to update flash due to stored data changes
unsigned long long latestTimeStamp              = 0;
unsigned short msmt_id                          = 1;
bool first_cont_sent                            = false;
#if (USES_STORED_DATA == 1)
    s_MsmtData storedMsmts[NUMBER_OF_STORED_MSMTS];     // Maximum number of stored msmts NUMBER_OF_STORED_MSMTS you want to support.
                                                        // The s_MsmtData struct contains all the information that we will get from
                                                        // the sensor. It is specified in the handleSpecializations.h file. You can
                                                        // create whatever structure you need depending upon your use case, but you will
                                                        // need to modify the code in this file accordingly. 
#endif
/*
 * The epoch defines our base value which does not change during the connection unless it is
 * changed by a PHG set time. The base value is 0 if a relative time otherwise we set it to
 * a factory default for UTC (which will be wrong) but it will be corrected on the first set 
 * time by the PHG. We add the current tick counter to this base epoch to report our current
 * time and time stamps.
 */
unsigned long long epoch                        = 0;
unsigned long long factor                       = 1L;

// Needed just because we use the same board for different options with stored flash.
// When the namekey is different than that in flash, flash is not loaded
#if (BP_CUFF == 1)
    const char nameKey[10] = {'M', 'E', 'T', '_', 'B', 'P', ' ', ' ', ' ', ' '};
#endif
#if (PULSE_OX == 1)
    const char nameKey[10] = {'M', 'E', 'T', '_', 'P', 'O', 'X', 'M', ' ', ' '};
#endif
#if (GLUCOSE == 1)
    const char nameKey[10] = {'M', 'E', 'T', '_', 'G', 'L', 'U', 'C', ' ', ' '};
#endif
#if (HEART_RATE == 1)
    const char nameKey[10] = {'M', 'E', 'T', '_', 'H', 'R', ' ', ' ', ' ', ' '};
#endif
#if (SPIROMETER == 1)
    const char nameKey[10] = {'M', 'E', 'T', '_', 'S', 'P', 'I', 'R', ' ', ' '};
#endif
#if (SCALE == 1)
    const char nameKey[10] = {'M', 'E', 'T', '_', 'S', 'C', 'A', 'L', ' ', ' '};
#endif
#if (THERMOMETER == 1)
    const char nameKey[10] = {'M', 'E', 'T', '_', 'T', 'E', 'M', 'P', ' ', ' '};
#endif


extern s_Queue *queue;

