brianreinhold/NordicPHDs/nRF52/ble_app_met_epoch/handleSpecializations.c
extern volatile s_global_send global_send;
extern nrf_mutex_t q_mutex;

void ble_disconnected_handler(void *);

bool readyToSend();
bool prepareMeasurements(s_MsmtGroupData *msmtGroupData);

/*
 * Bt Addresses:
 *      AA:4D:E3:02:F1:02   BP Cuff
 *      AA:4D:E3:02:F1:01   Pulse Ox
 *      AA:4D:E3:02:F1:04   Glucose
 *      AA:4D:E3:02:F1:07   Heart Rate
 *      AA:4D:E3:02:F1:03   Spirometer
 *      AA:4D:E3:02:F1:06   Scale
 *      AA:4D:E3:02:F1:05   Thermometer
 */

/**
 * Here the specialization -specific variables are defined. Some of the more important are
 * the data array pointers, and the structure that will carry the variables that would normally
 * be updated from a sensor, for example in the BP there is the sys, dias, mean, and PR as well
 * as the time stamp and whether or not time stamps are used. We also specify the array of these
 * structures that are to hold stored data.
 * The other variables of interest are the '_index' variables. These are created by the library
 * when you add a measurement to a group. When you want to update a value of that measurement, this
 * index value is passed to the update method. The index value gives the position in the group
 * of the measurement, so it is just a value starting at 0 for the measurement first in the group
 * and increasing after. That index is used by the library to get a structure that has position
 * information for the updated variables in that measurement. For example, if you are updating the
 * pulse rate of the BP cuff, pr_index might be 1 (and bp_index is likely 0) and that gets the
 * internal msmtIndex[pr_index] struct. That struct contains index of the pulse rate in the entire
 * data array so the library can insert that value into the data array.
 * The application does not need to understand any of this. The library creates the pr_index and
 * the app only needs to use that value when updating the PR.
 */

#if (BP_CUFF == 1)
                                                    // We are not going to send this data optimized. Real BP cuffs take one
                                                    // measurement and send it if possible. The only arguement for optimization
                                                    // might be if you store many measurements before sending. Optimization is
                                                    // most useful for something like streaming pulse oximeter data in real time.
    unsigned short BLE_APPEARANCE = BLE_APPEARANCE_GENERIC_BLOOD_PRESSURE; // The appearance goies into the advertisement. It is
                                                                           // not necessary. These values are standardized by BT
                                                                           // SIG.
    static unsigned char bluetoothAddress[]         = {0x02, 0xF1, 0x02, 0xE3, 0x4D, 0xAA}; // Bluetooth address AA:4D:E3:02:F1:02
                                                                                            // in little endian. Every device needs that.
    static unsigned char systemId[]                 = {0x02, 0xF1, 0x02, 0xFF, 0xFE, 0xE3, 0x4D, 0xAA}; // This is the IEEE system id
                                                                                                        // We generate one from the
                                                                                                        // Bluetooth address. This value
                                                                                                        // is used in the SystemInfo which
                                                                                                        // also contains info like the
                                                                                                        // serial number.

    char *DEVICE_NAME                               = "Met BP";                 // The device name. Used in the advertisement. Don't make
                                                                                // too long or there wont be enough space in the advertisement.
    unsigned short SPECIALIZATION                   = MDC_DEV_SPEC_PROFILE_BP;  // This is the MDC code for blood pressure. It will appear
                                                                                // in the service data field. Since the UUID of every MET
                                                                                // is the same, in order to tell what kind of device it is
                                                                                // the service data field is used. This value is also sent
                                                                                // in the systemInfo (equivalent to the DIS information). It 
                                                                                // is very important to include the specialization code!
    static char *MODEL_NUMBER                       = "MET-BP-234r";            // The System Info model number
    static char *MANUFACTURER_NAME                  = "MET Blood Pressure";     // The System Info manufacturer name
    static char *SERIAL_NUMBER                      = "snX-4956";               // The System Info serial number
    static char *FIRMWARE_VERSION                   = "fw90.9";                 // The System Info firmware version
    static char *HARDWARE_VERSION                   = "hw5.7.61";               // The System Info hardware version
    static char *SOFTWARE_VERSION                   = "sw0.0.5";                // The System Info software version

    static char *UDI_LABEL                          = "udi label";
    static char *UDI_DEV_ID                         = "udi device blood pressure cuff";
    static char *UDI_ISSUER_OID                     = "1.2.3.4.5.6.777";
    static char *UDI_AUTH_OID                       = "2.16.840.1.113883.3.24";
                                                            // multiple of these events at once.
    s_MsmtGroupData *msmtGroupBpData                = NULL; // This is a pointer to a struct that will contain the final data array to be sent
                                                            // to the client. The library will create and populate this structure for you and
                                                            // you will call a set of update methods to place the received sensor values into
                                                            // the final data array. The structure contains additional information as well, the
                                                            // most important being the locations in the data array for the updated measurement
                                                            // values.
    s_MsmtGroupData *msmtGroupOptimizedBpData       = NULL; // This structure would be the optimized version of the above data array. We do not
                                                            // use it in the BP example
    short bp_index                                  = -1;   // The bp_index is the placing (order) of the bp measurement in the data array. This value is
                                                            // is returned by the 'addMetMsmtToGroup() method. If the bp measurement is the first
                                                            // measurement you add to the group, the value will be 0. If it is the second, the
                                                            // value will be 1. In this example we add it first. You will need this value when
                                                            // calling the update methods to enter new BP values into the data array. Do not change
                                                            // this value! Initialize it to -1 to indicate that it has not been defined yet.
    short pr_index                                  = -1;   // The pr_index is the placing of the pulse rate measurement in the data array. In our
                                                            // example, we place it second so the value would be 1. Do not change
                                                            // this value! Initialize it to -1 to indicate that it has not been used yet.
    short status_index                              = -1;   // The status_index is the placing of the status measurement in the data array. We place it
                                                            // third so its value would be 2. 
                                                            // Intermittent use. Status events are fairly common for some devices but they do not always
                                                            // occur. SO there are two options for devices that support intermittent status events.
                                                            // The first is to just send a value of all 0's to indicate that nothing of interest happened
                                                            // (usually means the measurement happened without problems so no status event is generally
                                                            // a good thing). The other option is to not send the status measurement at all unless it
                                                            // happens.
                                                            // In order to support the latter case (for efficiency) there is a method called 
                                                            // updateDataDropLastMsmt that when called will populate some of the parameters of
                                                            // the msmtGroupBpData struct such that the last measurement in the group is not sent. All
                                                            // the remaining header parameters are adjusted accordingly. There is a second method 
                                                            // updateDataRestoreLastMsmt that will reset the parameters such that the last measurement
                                                            // will be sent. We do that here. We create all three measurement types and add the status
                                                            // measurement LAST. Then we call the drop method. When status events are received from our
                                                            // fake sensor, we call the update method and update the status msmt with those values. We 
                                                            // call the drop method on the next measurement not to have status events.
#endif

#if (PULSE_OX == 1)
    unsigned short BLE_APPEARANCE = BLE_APPEARANCE_PULSE_OXIMETER_FINGERTIP;
    static unsigned char bluetoothAddress[]         = {0x01, 0xF1, 0x02, 0xE3, 0x4D, 0xAA}; // AA:4D:E3:02:F1:01 in little endian
    static unsigned char systemId[]                 = {0x01, 0xF1, 0x02, 0xFF, 0xFE, 0xE3, 0x4D, 0xAA};

    char *DEVICE_NAME                               = "Met Pulse Ox";
    unsigned short SPECIALIZATION                   = MDC_DEV_SPEC_PROFILE_PULS_OXIM;
    static char *MODEL_NUMBER                       = "MET-PO-234r";
    static char *MANUFACTURER_NAME                  = "MET Pulse Oximetry";
    static char *SERIAL_NUMBER                      = "snX-4956";               // The System Info serial number
    static char *FIRMWARE_VERSION                   = "fw90.9";                 // The System Info firmware version
    static char *HARDWARE_VERSION                   = "hw5.7.61";               // The System Info hardware version
    static char *SOFTWARE_VERSION                   = "sw0.0.5";                // The System Info software version

