brianreinhold/NordicPHDs/nRF52/ble_app_met_epoch/handleSpecializations.c
    static char *UDI_LABEL                          = "udi label";
    static char *UDI_DEV_ID                         = "udi device pulse oximter";
    static char *UDI_ISSUER_OID                     = "1.2.3.4.5.6.777";
    static char *UDI_AUTH_OID                       = "2.16.840.1.113883.3.24";
    s_MsmtGroupData *msmtGroupSpotData              = NULL;
    s_MsmtGroupData *msmtGroupContData              = NULL;
    s_MsmtGroupData *msmtGroupOptimizedContData     = NULL;
    short spo2_index                                = -1;
    short pr_index                                  = -1;
    short qual_index                                = -1;
    short spo2_cont_index                           = -1;
    short pr_cont_index                             = -1;
    short qual_cont_index                           = -1;
#endif
#if (GLUCOSE == 1)
    unsigned short BLE_APPEARANCE = BLE_APPEARANCE_GENERIC_GLUCOSE_METER;
    static unsigned char bluetoothAddress[]         = {0x04, 0xF1, 0x02, 0xE3, 0x4D, 0xAA}; // AA:4D:E3:02:F1:04 in little endian
    static unsigned char systemId[]                 = {0x04, 0xF1, 0x02, 0xFF, 0xFE, 0xE3, 0x4D, 0xAA};

    char *DEVICE_NAME                               = "Met Glucose";
    unsigned short SPECIALIZATION                   = MDC_DEV_SPEC_PROFILE_GLUCOSE;
    static char *MODEL_NUMBER                       = "MET-GLUC-234r";
    static char *MANUFACTURER_NAME                  = "MET Diabetes Monitoring";
    static char *SERIAL_NUMBER                      = "snX-4956";               // The System Info serial number
    static char *FIRMWARE_VERSION                   = "fw90.9";                 // The System Info firmware version
    static char *HARDWARE_VERSION                   = "hw5.7.61";               // The System Info hardware version
    static char *SOFTWARE_VERSION                   = "sw0.0.5";                // The System Info software version

    static char *UDI_LABEL                          = "udi label";
    static char *UDI_DEV_ID                         = "udi device glucose";
    static char *UDI_ISSUER_OID                     = "1.2.3.4.5.6.777";
    static char *UDI_AUTH_OID                       = "2.16.840.1.113883.3.24";
    s_MsmtGroupData *msmtGroupGlucData              = NULL;
    short conc_index                                = -1;
    short meds_index                                = -1;
    short carbs_index                               = -1;
    short exer_index                                = -1;
#endif
#if (HEART_RATE == 1)
    unsigned short BLE_APPEARANCE = BLE_APPEARANCE_GENERIC_HEART_RATE_SENSOR;
    static unsigned char bluetoothAddress[]         = {0x07, 0xF1, 0x02, 0xE3, 0x4D, 0xAA}; // AA:4D:E3:02:F1:07 in little endian
    static unsigned char systemId[]                 = {0x07, 0xF1, 0x02, 0xFF, 0xFE, 0xE3, 0x4D, 0xAA};

    char *DEVICE_NAME                               = "Met Heart Rate";
    unsigned short SPECIALIZATION                   = MDC_DEV_SUB_SPEC_PROFILE_HR;
    static char *MODEL_NUMBER                       = "MET-HR-234r";
    static char *MANUFACTURER_NAME                  = "MET Health Monitoring";
    static char *SERIAL_NUMBER                      = "snX-4444";               // The System Info serial number
    static char *FIRMWARE_VERSION                   = "fw10.9";                 // The System Info firmware version
    static char *HARDWARE_VERSION                   = "hw5.5.61";               // The System Info hardware version
    static char *SOFTWARE_VERSION                   = "sw3.0";                  // The System Info software version

    static char *UDI_LABEL                          = "udi label";
    static char *UDI_DEV_ID                         = "udi device heart rate";
    static char *UDI_ISSUER_OID                     = "1.2.3.4.5.6.777";
    static char *UDI_AUTH_OID                       = "2.16.840.1.113883.3.24";
    s_MsmtGroupData *msmtGroupHrData                = NULL;
    s_MsmtGroupData *msmtGroupHrOptimizedData       = NULL;
    short hr_index                                  = -1;
#endif
/**
 * It's hard to generate Spirometry data that makes even remote sense, especially the waveforms. So in this case we use data
 * from an actual maneuver and report that as live data only and its a one-shot deal. The time keeps invoking the live data
 * generator every 5 seconds in this case but once the sequence is done and the final ATS summary results are reported, no
 * more data is sent. Only one maneuver is done as well as it takes SO much space to store the waveforms.
 */
#if (SPIROMETER == 1)
unsigned char flowBytes[] = {
 0x09, 0x00, 0x54, 0x00, 0x8A, 0x01, 0xC9, 0x03, 0x77, 0x05, 0x54, 0x05, 0x7D, 0x04, 0x69, 0x04, 0xD2, 0x04, 0x1D, 0x05, 0x45, 0x05, 0x68, 0x05, 0x77, 0x05, 0x63, 0x05, 0x40, 0x05, 0x31, 0x05, // 32
 0x31, 0x05, 0x31, 0x05, 0x4A, 0x05, 0x3B, 0x05, 0x22, 0x05, 0x2C, 0x05, 0x27, 0x05, 0xFA, 0x04, 0xC3, 0x04, 0xAF, 0x04, 0xBE, 0x04, 0xDC, 0x04, 0xF5, 0x04, 0xF5, 0x04, 0xB9, 0x04, 0x6E, 0x04,
 0x4B, 0x04, 0x64, 0x04, 0xA0, 0x04, 0xC3, 0x04, 0xB4, 0x04, 0xAF, 0x04, 0xB4, 0x04, 0xA0, 0x04, 0x82, 0x04, 0x8C, 0x04, 0xA5, 0x04, 0xB9, 0x04, 0xB9, 0x04, 0xA0, 0x04, 0x8C, 0x04, 0x73, 0x04, 
 0x46, 0x04, 0x50, 0x04, 0xA0, 0x04, 0xD7, 0x04, 0xAF, 0x04, 0x55, 0x04, 0x3C, 0x04, 0x5F, 0x04, 0x64, 0x04, 0x50, 0x04, 0x5A, 0x04, 0x55, 0x04, 0x32, 0x04, 0x5F, 0x04, 0x9B, 0x04, 0x8C, 0x04, 
 0x41, 0x04, 0x28, 0x04, 0x32, 0x04, 0x3C, 0x04, 0x69, 0x04, 0x82, 0x04, 0x5A, 0x04, 0x32, 0x04, 0x32, 0x04, 0x1E, 0x04, 0xE2, 0x03, 0xEC, 0x03, 0x1E, 0x04, 0xF1, 0x03, 0xC9, 0x03, 0x0A, 0x04,
 0x41, 0x04, 0xF1, 0x03, 0x9C, 0x03, 0xCE, 0x03, 0x00, 0x04, 0xBA, 0x03, 0x97, 0x03, 0xC9, 0x03, 0xBF, 0x03, 0x6A, 0x03, 0x7E, 0x03, 0xF1, 0x03, 0x19, 0x04, 0xD3, 0x03, 0xA1, 0x03, 0x83, 0x03,
 0x60, 0x03, 0x88, 0x03, 0xCE, 0x03, 0xA1, 0x03, 0x6A, 0x03, 0x79, 0x03, 0x92, 0x03, 0x79, 0x03, 0x6A, 0x03, 0x79, 0x03, 0x83, 0x03, 0x8D, 0x03, 0x92, 0x03, 0x6F, 0x03, 0x6F, 0x03, 0x88, 0x03,
 0x7E, 0x03, 0x74, 0x03, 0x83, 0x03, 0x65, 0x03, 0x15, 0x03, 0xFC, 0x02, 0x2E, 0x03, 0x5B, 0x03, 0x65, 0x03, 0x65, 0x03, 0x60, 0x03, 0x3D, 0x03, 0x2E, 0x03, 0x5B, 0x03, 0x79, 0x03, 0x60, 0x03,
 0x1A, 0x03, 0x06, 0x03, 0x33, 0x03, 0x3D, 0x03, 0x29, 0x03, 0x3D, 0x03, 0x24, 0x03, 0xF7, 0x02, 0x38, 0x03, 0x6A, 0x03, 0x15, 0x03, 0xD9, 0x02, 0xF7, 0x02, 0x10, 0x03, 0x29, 0x03, 0x29, 0x03,
 0x01, 0x03, 0xCF, 0x02, 0xAC, 0x02, 0xCF, 0x02, 0x15, 0x03, 0x15, 0x03, 0xF2, 0x02, 0xF2, 0x02, 0xE3, 0x02, 0xB6, 0x02, 0xCA, 0x02, 0xE3, 0x02, 0xC0, 0x02, 0xA7, 0x02, 0xB1, 0x02, 0xD9, 0x02,
 0xED, 0x02, 0xDE, 0x02, 0xC0, 0x02, 0xB1, 0x02, 0xB6, 0x02, 0xB6, 0x02, 0xA2, 0x02, 0xB1, 0x02, 0xC0, 0x02, 0xAC, 0x02, 0xB1, 0x02, 0xC5, 0x02, 0xAC, 0x02, 0xBB, 0x02, 0xE3, 0x02, 0xBB, 0x02,
 0x7F, 0x02, 0x8E, 0x02, 0xC5, 0x02, 0xCF, 0x02, 0xAC, 0x02, 0x8E, 0x02, 0x93, 0x02, 0xA2, 0x02, 0x70, 0x02, 0x61, 0x02, 0x8E, 0x02, 0x70, 0x02, 0x61, 0x02, 0x9D, 0x02, 0xA2, 0x02, 0x89, 0x02,
 0x75, 0x02, 0x48, 0x02, 0x3E, 0x02, 0x5C, 0x02, 0x57, 0x02, 0x61, 0x02, 0x93, 0x02, 0x7F, 0x02, 0x2F, 0x02, 0x57, 0x02, 0x89, 0x02, 0x48, 0x02, 0x6B, 0x02, 0xBB, 0x02, 0x75, 0x02, 0x84, 0x02,
 0xD4, 0x02, 0x84, 0x02, 0x2A, 0x02, 0x3E, 0x02, 0x39, 0x02, 0x39, 0x02, 0x70, 0x02, 0x75, 0x02, 0x39, 0x02, 0x34, 0x02, 0x34, 0x02, 0x20, 0x02, 0x11, 0x02, 0x16, 0x02, 0x34, 0x02, 0x52, 0x02,
 0x61, 0x02, 0x6B, 0x02, 0x66, 0x02, 0x4D, 0x02, 0x16, 0x02, 0xEE, 0x01, 0xFD, 0x01, 0x11, 0x02, 0x16, 0x02, 0x39, 0x02, 0x2A, 0x02, 0xD5, 0x01, 0xDA, 0x01, 0x1B, 0x02, 0x0C, 0x02, 0xFD, 0x01,
 0x34, 0x02, 0x43, 0x02, 0x1B, 0x02, 0x0C, 0x02, 0x1B, 0x02, 0x1B, 0x02, 0x25, 0x02, 0x0C, 0x02, 0xF8, 0x01, 0xF3, 0x01, 0xE9, 0x01, 0xE9, 0x01, 0xF8, 0x01, 0x0C, 0x02, 0x1B, 0x02, 0x07, 0x02,
 0xF3, 0x01, 0xF3, 0x01, 0xDA, 0x01, 0xBC, 0x01, 0xE9, 0x01, 0xE9, 0x01, 0xD0, 0x01, 0xF8, 0x01, 0xF8, 0x01, 0xDF, 0x01, 0x2A, 0x02, 0x07, 0x02, 0xB2, 0x01, 0xFD, 0x01, 0x20, 0x02, 0xE4, 0x01,
 0x11, 0x02, 0x0C, 0x02, 0xC1, 0x01, 0xCB, 0x01, 0xCB, 0x01, 0xB2, 0x01, 0xEE, 0x01, 0xE9, 0x01, 0xB2, 0x01, 0xB2, 0x01, 0x94, 0x01, 0x9E, 0x01, 0xD0, 0x01, 0xC6, 0x01, 0xB7, 0x01, 0xA8, 0x01,
 0x9E, 0x01, 0xA8, 0x01, 0xB2, 0x01, 0x9E, 0x01, 0x94, 0x01, 0xB2, 0x01, 0xBC, 0x01, 0xC6, 0x01, 0xC6, 0x01, 0xA8, 0x01, 0xB7, 0x01, 0xC6, 0x01, 0xB7, 0x01, 0xAD, 0x01, 0x6C, 0x01, 0x67, 0x01,
 0xBC, 0x01, 0xB7, 0x01, 0xB7, 0x01, 0xD5, 0x01, 0x8F, 0x01, 0x85, 0x01, 0xE4, 0x01, 0xDA, 0x01, 0xB2, 0x01, 0x9E, 0x01, 0x94, 0x01, 0x9E, 0x01, 0x76, 0x01, 0x76, 0x01, 0xB2, 0x01, 0x8A, 0x01,
 0x71, 0x01, 0xAD, 0x01, 0x8A, 0x01, 0x62, 0x01, 0x71, 0x01, 0x76, 0x01, 0xA8, 0x01, 0x9E, 0x01, 0x5D, 0x01, 0x53, 0x01, 0x4E, 0x01, 0x49, 0x01, 0x8A, 0x01, 0x8A, 0x01, 0x67, 0x01, 0x71, 0x01,
 0x62, 0x01, 0x5D, 0x01, 0x99, 0x01, 0x8A, 0x01, 0x71, 0x01, 0x71, 0x01, 0x44, 0x01, 0x62, 0x01, 0x7B, 0x01, 0x85, 0x01, 0x5D, 0x01, 0x3A, 0x01, 0x76, 0x01, 0x71, 0x01, 0x35, 0x01, 0x53, 0x01,
 0x3F, 0x01, 0x21, 0x01, 0x5D, 0x01, 0x49, 0x01, 0x26, 0x01, 0x4E, 0x01, 0x53, 0x01, 0x4E, 0x01, 0x35, 0x01, 0x30, 0x01, 0x80, 0x01, 0x76, 0x01, 0x3F, 0x01, 0x30, 0x01, 0x53, 0x01, 0x58, 0x01,
 0x44, 0x01, 0x30, 0x01, 0x21, 0x01, 0x35, 0x01, 0x62, 0x01, 0x5D, 0x01, 0x3A, 0x01, 0x2B, 0x01, 0x1C, 0x01, 0x08, 0x01, 0xF9, 0x00, 0x03, 0x01, 0x26, 0x01, 0x35, 0x01, 0x30, 0x01, 0x26, 0x01,
 0x30, 0x01, 0x3F, 0x01, 0x26, 0x01, 0x12, 0x01, 0x30, 0x01, 0x30, 0x01, 0x35, 0x01, 0x30, 0x01, 0x1C, 0x01, 0xF4, 0x00, 0xF9, 0x00, 0x12, 0x01, 0x17, 0x01, 0x26, 0x01, 0x26, 0x01, 0x17, 0x01,
 0x0D, 0x01, 0xD6, 0x00, 0xD6, 0x00, 0x1C, 0x01, 0x35, 0x01, 0x49, 0x01, 0x4E, 0x01, 0x35, 0x01, 0x21, 0x01, 0xEA, 0x00, 0xE0, 0x00, 0x21, 0x01, 0x3A, 0x01, 0x3A, 0x01, 0x17, 0x01, 0x03, 0x01,
 0xF9, 0x00, 0xEF, 0x00, 0xFE, 0x00, 0x0D, 0x01, 0x1C, 0x01, 0x12, 0x01, 0xD6, 0x00, 0xD1, 0x00, 0x0D, 0x01, 0x0D, 0x01, 0xE5, 0x00, 0xE5, 0x00, 0x0D, 0x01, 0x12, 0x01, 0x03, 0x01, 0x0D, 0x01,
 0x03, 0x01, 0xD1, 0x00, 0xC2, 0x00, 0xBD, 0x00, 0xD6, 0x00, 0x17, 0x01, 0x12, 0x01, 0xF4, 0x00, 0xC7, 0x00, 0xD1, 0x00, 0x12, 0x01, 0xF4, 0x00, 0xDB, 0x00, 0xDB, 0x00, 0xD6, 0x00, 0xC7, 0x00,
 0xE5, 0x00, 0xF9, 0x00, 0xEA, 0x00, 0xD6, 0x00, 0xEA, 0x00, 0x0D, 0x01, 0xF9, 0x00, 0xE5, 0x00, 0xE0, 0x00, 0xD6, 0x00, 0xC7, 0x00, 0xDB, 0x00, 0xE0, 0x00, 0xD1, 0x00, 0xDB, 0x00, 0xEA, 0x00,
 0xC7, 0x00, 0xCC, 0x00, 0xD6, 0x00, 0xB8, 0x00, 0xC2, 0x00, 0xD6, 0x00, 0xEA, 0x00, 0xD1, 0x00, 0xBD, 0x00, 0xB8, 0x00, 0xB8, 0x00, 0xE0, 0x00, 0xCC, 0x00, 0xB8, 0x00, 0xDB, 0x00, 0xC2, 0x00,
 0xA4, 0x00, 0xA9, 0x00, 0xAE, 0x00, 0xAE, 0x00, 0xD1, 0x00, 0xD6, 0x00, 0xC7, 0x00, 0xE0, 0x00, 0xC7, 0x00, 0xAE, 0x00, 0xDB, 0x00, 0xD1, 0x00, 0xBD, 0x00, 0xD1, 0x00, 0xBD, 0x00, 0xBD, 0x00,
 0xE5, 0x00, 0xC2, 0x00, 0x9A, 0x00, 0x90, 0x00, 0xB8, 0x00, 0xDB, 0x00, 0xC2, 0x00, 0xAE, 0x00, 0x9F, 0x00, 0xB8, 0x00, 0xB8, 0x00, 0xA9, 0x00, 0xA9, 0x00, 0xB3, 0x00, 0xE5, 0x00, 0xD6, 0x00,
 0xA9, 0x00, 0x86, 0x00, 0x9A, 0x00, 0xE0, 0x00, 0xE0, 0x00, 0xA9, 0x00, 0x81, 0x00, 0x6D, 0x00, 0x9A, 0x00, 0xEF, 0x00, 0xEA, 0x00, 0xAE, 0x00, 0x81, 0x00, 0x86, 0x00, 0x9A, 0x00, 0xC2, 0x00,
 0xEF, 0x00, 0xCC, 0x00, 0x95, 0x00, 0x7C, 0x00, 0x77, 0x00, 0x7C, 0x00, 0x86, 0x00, 0xA4, 0x00, 0xB8, 0x00, 0xD6, 0x00, 0xD6, 0x00, 0xB3, 0x00, 0x95, 0x00, 0x77, 0x00, 0x68, 0x00, 0x86, 0x00,
 0x8B, 0x00, 0x9A, 0x00, 0xA4, 0x00, 0x9F, 0x00, 0x90, 0x00, 0x8B, 0x00, 0x90, 0x00, 0xA4, 0x00, 0x9F, 0x00, 0x95, 0x00, 0x8B, 0x00, 0x90, 0x00, 0x8B, 0x00, 0x86, 0x00, 0x95, 0x00, 0x90, 0x00,
 0x8B, 0x00, 0x95, 0x00, 0x9F, 0x00, 0x9A, 0x00, 0x90, 0x00, 0x8B, 0x00, 0x90, 0x00, 0x9F, 0x00, 0x9F, 0x00, 0x7C, 0x00, 0x54, 0x00, 0x54, 0x00, 0x63, 0x00, 0x77, 0x00, 0xA9, 0x00, 0xAE, 0x00, 
 0x9A, 0x00, 0x8B, 0x00, 0x90, 0x00, 0x8B, 0x00, 0x72, 0x00, 0x63, 0x00, 0x68, 0x00, 0x81, 0x00, 0x9A, 0x00, 0xAE, 0x00, 0xA4, 0x00, 0x9A, 0x00, 0x77, 0x00, 0x4F, 0x00, 0x40, 0x00, 0x6D, 0x00,
 0x9F, 0x00, 0xA9, 0x00, 0x9A, 0x00, 0x86, 0x00, 0x63, 0x00, 0x54, 0x00, 0x7C, 0x00, 0x95, 0x00, 0x90, 0x00, 0x68, 0x00, 0x54, 0x00, 0x77, 0x00, 0x81, 0x00, 0x6D, 0x00, 0x4A, 0x00, 0x59, 0x00,
 0x77, 0x00, 0x90, 0x00, 0x90, 0x00, 0x72, 0x00, 0x72, 0x00, 0x77, 0x00, 0x86, 0x00, 0x7C, 0x00, 0x5E, 0x00, 0x5E, 0x00, 0x77, 0x00, 0x90, 0x00, 0x7C, 0x00, 0x63, 0x00, 0x63, 0x00, 0x5E, 0x00,
 0x4A, 0x00, 0x45, 0x00, 0x7C, 0x00, 0x95, 0x00, 0x86, 0x00, 0x68, 0x00, 0x4A, 0x00, 0x3B, 0x00, 0x59, 0x00, 0x8B, 0x00, 0xA9, 0x00, 0x86, 0x00, 0x5E, 0x00, 0x59, 0x00, 0x59, 0x00, 0x4F, 0x00,
 0x63, 0x00, 0x72, 0x00, 0x68, 0x00, 0x63, 0x00, 0x5E, 0x00, 0x40, 0x00, 0x36, 0x00, 0x59, 0x00, 0x6D, 0x00, 0x72, 0x00, 0x90, 0x00, 0x8B, 0x00, 0x68, 0x00, 0x4A, 0x00, 0x3B, 0x00, 0x40, 0x00,
 0x72, 0x00, 0x81, 0x00, 0x77, 0x00, 0x81, 0x00, 0x68, 0x00, 0x54, 0x00, 0x4F, 0x00, 0x45, 0x00, 0x4A, 0x00, 0x77, 0x00, 0x86, 0x00, 0x63, 0x00, 0x31, 0x00, 0x2C, 0x00, 0x59, 0x00, 0x6D, 0x00,
 0x59, 0x00, 0x36, 0x00, 0x4A, 0x00, 0x77, 0x00, 0x81, 0x00, 0x72, 0x00, 0x4F, 0x00, 0x40, 0x00, 0x59, 0x00, 0x63, 0x00, 0x4F, 0x00, 0x36, 0x00, 0x54, 0x00, 0x7C, 0x00, 0x81, 0x00, 0x63, 0x00,
 0x3B, 0x00, 0x22, 0x00, 0x13, 0x00, 0x36, 0x00, 0x7C, 0x00, 0x90, 0x00, 0x68, 0x00, 0x31, 0x00, 0x36, 0x00, 0x40, 0x00, 0x45, 0x00, 0x3B, 0x00, 0x4F, 0x00, 0x68, 0x00, 0x6D, 0x00, 0x6D, 0x00,
 0x5E, 0x00, 0x45, 0x00, 0x31, 0x00, 0x40, 0x00, 0x4F, 0x00, 0x45, 0x00, 0x31, 0x00, 0x40, 0x00, 0x4F, 0x00, 0x4F, 0x00, 0x45, 0x00, 0x5E, 0x00, 0x6D, 0x00, 0x59, 0x00, 0x31, 0x00, 0x18, 0x00,
 0x18, 0x00, 0x45, 0x00, 0x63, 0x00, 0x5E, 0x00, 0x45, 0x00, 0x54, 0x00, 0x63, 0x00, 0x5E, 0x00, 0x40, 0x00, 0x40, 0x00, 0x45, 0x00, 0x3B, 0x00, 0x31, 0x00, 0x45, 0x00, 0x59, 0x00, 0x54, 0x00,
 0x36, 0x00, 0x2C, 0x00, 0x4F, 0x00, 0x63, 0x00, 0x54, 0x00, 0x36, 0x00, 0x36, 0x00, 0x40, 0x00, 0x40, 0x00, 0x36, 0x00, 0x4A, 0x00, 0x59, 0x00, 0x4A, 0x00, 0x31, 0x00, 0x18, 0x00, 0x18, 0x00,
 0x36, 0x00, 0x6D, 0x00, 0x77, 0x00, 0x59, 0x00, 0x27, 0x00, 0x13, 0x00, 0x22, 0x00, 0x36, 0x00, 0x3B, 0x00, 0x45, 0x00, 0x6D, 0x00, 0x72, 0x00, 0x59, 0x00, 0x27, 0x00, 0x1D, 0x00, 0x31, 0x00,
 0x45, 0x00, 0x40, 0x00, 0x22, 0x00, 0x1D, 0x00, 0x3B, 0x00, 0x59, 0x00, 0x54, 0x00, 0x31, 0x00, 0x22, 0x00, 0x45, 0x00, 0x59, 0x00, 0x4A, 0x00, 0x27, 0x00, 0x13, 0x00, 0x22, 0x00, 0x31, 0x00,
 0x31, 0x00, 0x27, 0x00, 0x1D, 0x00, 0x1D, 0x00, 0x1D, 0x00, 0x31, 0x00, 0x68, 0x00, 0x7C, 0x00, 0x63, 0x00, 0x31, 0x00, 0x18, 0x00, 0x2C, 0x00, 0x3B, 0x00, 0x36, 0x00, 0x22, 0x00, 0x13, 0x00,
 0x18, 0x00, 0x3B, 0x00, 0x54, 0x00, 0x4A, 0x00, 0x36, 0x00, 0x31, 0x00, 0x59, 0x00, 0x68, 0x00, 0x4F, 0x00, 0x27, 0x00, 0x04, 0x00, 0x04, 0x00, 0x1D, 0x00, 0x36, 0x00, 0x3B, 0x00, 0x2C, 0x00,
 0x1D, 0x00, 0x22, 0x00, 0x54, 0x00, 0x6D, 0x00, 0x59, 0x00, 0x31, 0x00, 0x0E, 0x00, 0x00, 0x00, 0x09, 0x00, 0x13, 0x00, 0x27, 0x00, 0x4A, 0x00, 0x54, 0x00, 0x3B, 0x00, 0x18, 0x00, 0x09, 0x00,
 0x09, 0x00, 0x18, 0x00, 0x3B, 0x00, 0x4F, 0x00, 0x45, 0x00, 0x2C, 0x00, 0x1D, 0x00, 0x22, 0x00, 0x4F, 0x00, 0x63, 0x00, 0x4F, 0x00, 0x27, 0x00, 0x0E, 0x00, 0x00, 0x00, 0x0E, 0x00, 0x22, 0x00, 
 0x31, 0x00, 0x2C, 0x00, 0x18, 0x00, 0x0E, 0x00, 0x0E, 0x00, 0x1D, 0x00, 0x54, 0x00, 0x77, 0x00, 0x59, 0x00, 0x27, 0x00, 0x04, 0x00, 0x00, 0x00, 0x13, 0x00, 0x3B, 0x00, 0x45, 0x00, 0x36, 0x00,
 0x18, 0x00, 0x09, 0x00, 0x09, 0x00, 0x09, 0x00, 0x0E, 0x00, 0x31, 0x00, 0x40, 0x00, 0x3B, 0x00, 0x27, 0x00, 0x18, 0x00, 0x09, 0x00, 0x09, 0x00, 0x13, 0x00, 0x1D, 0x00, 0x1D, 0x00, 0x27, 0x00,
 0x54, 0x00, 0x68, 0x00, 0x4F, 0x00, 0x1D, 0x00, 0x04, 0x00, 0x00, 0x00, 0x09, 0x00, 0x18, 0x00, 0x2C, 0x00, 0x3B, 0x00, 0x2C, 0x00, 0x1D, 0x00, 0x13, 0x00, 0x13, 0x00, 0x13, 0x00, 0x1D, 0x00,
 0x4F, 0x00, 0x6D, 0x00, 0x59, 0x00, 0x31, 0x00, 0x0E, 0x00, 0x00, 0x00, 0x04, 0x00, 0x13, 0x00, 0x31, 0x00, 0x45, 0x00, 0x36, 0x00, 0x18, 0x00, 0x09, 0x00, 0x09, 0x00, 0x0E, 0x00, 0x13, 0x00,
 0x18, 0x00, 0x31, 0x00, 0x45, 0x00, 0x36, 0x00, 0x1D, 0x00, 0x09, 0x00, 0x09, 0x00, 0x09, 0x00, 0x0E, 0x00, 0x1D, 0x00, 0x4F, 0x00, 0x63, 0x00, 0x4F, 0x00, 0x1D, 0x00, 0xFC, 0xFF, 0xF7, 0xFF,
 0xFC, 0xFF, 0x00, 0x00, 0x09, 0x00, 0x0E, 0x00, 0x22, 0x00, 0x31, 0x00, 0x2C, 0x00, 0x1D, 0x00, 0x13, 0x00, 0x13, 0x00, 0x0E, 0x00, 0x09, 0x00, 0x09, 0x00, 0x13, 0x00, 0x13, 0x00, 0x13, 0x00,
 0x13, 0x00, 0x09, 0x00, 0x18, 0x00, 0x40, 0x00, 0x5E, 0x00, 0x4F, 0x00, 0x27, 0x00, 0x04, 0x00, 0x00, 0x00, 0x04, 0x00, 0x09, 0x00, 0x09, 0x00, 0x18, 0x00, 0x2C, 0x00, 0x31, 0x00, 0x2C, 0x00,
 0x18, 0x00, 0x04, 0x00, 0x04, 0x00, 0x0E, 0x00, 0x13, 0x00, 0x13, 0x00, 0x0E, 0x00, 0x0E, 0x00, 0x27, 0x00, 0x3B, 0x00, 0x2C, 0x00, 0x18, 0x00, 0x04, 0x00, 0x00, 0x00, 0x09, 0x00, 0x13, 0x00,
 0x13, 0x00, 0x0E, 0x00, 0x09, 0x00, 0x13, 0x00, 0x40, 0x00, 0x63, 0x00, 0x4F, 0x00, 0x1D, 0x00, 0xFC, 0xFF, 0xF7, 0xFF, 0x04, 0x00, 0x0E, 0x00, 0x13, 0x00, 0x09, 0x00, 0x00, 0x00, 0x09, 0x00,
 0x22, 0x00, 0x31, 0x00, 0x2C, 0x00, 0x18, 0x00, 0x09, 0x00, 0x00, 0x00, 0x04, 0x00, 0x09, 0x00};

