brianreinhold/NordicPHDs/nRF52/ble_app_met_epoch/handleSpecializations.c
/*
unsigned char volBytes[] = {0x00, 0x00, 0x00, 0x00, 0x04, 0x00, 0x0E, 0x00, 0x1C, 0x00, 0x2A, 0x00, 0x35, 0x00, 0x40, 0x00, 0x4D, 0x00, 0x5A, 0x00, 0x67, 0x00, 0x75, 0x00, 0x83, 0x00, 0x91, 0x00, 0x9E, 0x00,
 0xAC, 0x00, 0xB9, 0x00, 0xC6, 0x00, 0xD4, 0x00, 0xE1, 0x00, 0xEF, 0x00, 0xFC, 0x00, 0x09, 0x01, 0x16, 0x01, 0x22, 0x01, 0x2E, 0x01, 0x3A, 0x01, 0x47, 0x01, 0x53, 0x01, 0x60, 0x01, 0x6C, 0x01, 0x77, 0x01, 
 0x82, 0x01, 0x8E, 0x01, 0x99, 0x01, 0xA6, 0x01, 0xB2, 0x01, 0xBE, 0x01, 0xCA, 0x01, 0xD6, 0x01, 0xE1, 0x01, 0xED, 0x01, 0xF9, 0x01, 0x05, 0x02, 0x11, 0x02, 0x1D, 0x02, 0x28, 0x02, 0x34, 0x02, 0x3F, 0x02, 
 0x4A, 0x02, 0x56, 0x02, 0x62, 0x02, 0x6E, 0x02, 0x79, 0x02, 0x84, 0x02, 0x8F, 0x02, 0x9A, 0x02, 0xA6, 0x02, 0xB1, 0x02, 0xBC, 0x02, 0xC7, 0x02, 0xD2, 0x02, 0xDE, 0x02, 0xE9, 0x02, 0xF4, 0x02, 0xFF, 0x02, 
 0x09, 0x03, 0x14, 0x03, 0x20, 0x03, 0x2B, 0x03, 0x36, 0x03, 0x41, 0x03, 0x4C, 0x03, 0x56, 0x03, 0x60, 0x03, 0x6A, 0x03, 0x75, 0x03, 0x7F, 0x03, 0x89, 0x03, 0x93, 0x03, 0x9E, 0x03, 0xA8, 0x03, 0xB1, 0x03, 
 0xBB, 0x03, 0xC5, 0x03, 0xCF, 0x03, 0xD8, 0x03, 0xE2, 0x03, 0xEB, 0x03, 0xF4, 0x03, 0xFD, 0x03, 0x07, 0x04, 0x12, 0x04, 0x1B, 0x04, 0x25, 0x04, 0x2E, 0x04, 0x36, 0x04, 0x3F, 0x04, 0x49, 0x04, 0x53, 0x04, 
 0x5B, 0x04, 0x64, 0x04, 0x6D, 0x04, 0x76, 0x04, 0x7F, 0x04, 0x88, 0x04, 0x91, 0x04, 0x9A, 0x04, 0xA3, 0x04, 0xAC, 0x04, 0xB5, 0x04, 0xBE, 0x04, 0xC7, 0x04, 0xD0, 0x04, 0xD9, 0x04, 0xE1, 0x04, 0xE9, 0x04, 
 0xF1, 0x04, 0xF9, 0x04, 0x02, 0x05, 0x0A, 0x05, 0x13, 0x05, 0x1C, 0x05, 0x24, 0x05, 0x2C, 0x05, 0x35, 0x05, 0x3E, 0x05, 0x46, 0x05, 0x4E, 0x05, 0x56, 0x05, 0x5E, 0x05, 0x66, 0x05, 0x6F, 0x05, 0x77, 0x05, 
 0x7F, 0x05, 0x86, 0x05, 0x8F, 0x05, 0x97, 0x05, 0x9F, 0x05, 0xA7, 0x05, 0xAE, 0x05, 0xB6, 0x05, 0xBE, 0x05, 0xC6, 0x05, 0xCE, 0x05, 0xD5, 0x05, 0xDC, 0x05, 0xE3, 0x05, 0xEB, 0x05, 0xF3, 0x05, 0xFB, 0x05, 
 0x02, 0x06, 0x0A, 0x06, 0x11, 0x06, 0x18, 0x06, 0x1F, 0x06, 0x26, 0x06, 0x2D, 0x06, 0x34, 0x06, 0x3B, 0x06, 0x43, 0x06, 0x4A, 0x06, 0x51, 0x06, 0x58, 0x06, 0x5F, 0x06, 0x66, 0x06, 0x6D, 0x06, 0x73, 0x06, 
 0x7B, 0x06, 0x81, 0x06, 0x88, 0x06, 0x8F, 0x06, 0x96, 0x06, 0x9D, 0x06, 0xA5, 0x06, 0xAC, 0x06, 0xB2, 0x06, 0xB9, 0x06, 0xC0, 0x06, 0xC7, 0x06, 0xCE, 0x06, 0xD4, 0x06, 0xDB, 0x06, 0xE2, 0x06, 0xE8, 0x06, 
 0xEE, 0x06, 0xF5, 0x06, 0xFB, 0x06, 0x01, 0x07, 0x08, 0x07, 0x0E, 0x07, 0x15, 0x07, 0x1B, 0x07, 0x21, 0x07, 0x27, 0x07, 0x2D, 0x07, 0x33, 0x07, 0x39, 0x07, 0x3F, 0x07, 0x46, 0x07, 0x4B, 0x07, 0x51, 0x07, 
 0x58, 0x07, 0x5E, 0x07, 0x64, 0x07, 0x6B, 0x07, 0x71, 0x07, 0x78, 0x07, 0x7F, 0x07, 0x85, 0x07, 0x8B, 0x07, 0x91, 0x07, 0x96, 0x07, 0x9C, 0x07, 0xA2, 0x07, 0xA9, 0x07, 0xAE, 0x07, 0xB4, 0x07, 0xBA, 0x07, 
 0xBF, 0x07, 0xC4, 0x07, 0xCA, 0x07, 0xCF, 0x07, 0xD5, 0x07, 0xDC, 0x07, 0xE2, 0x07, 0xE8, 0x07, 0xEE, 0x07, 0xF3, 0x07, 0xF8, 0x07, 0xFD, 0x07, 0x02, 0x08, 0x08, 0x08, 0x0E, 0x08, 0x13, 0x08, 0x18, 0x08, 
 0x1D, 0x08, 0x22, 0x08, 0x27, 0x08, 0x2C, 0x08, 0x32, 0x08, 0x38, 0x08, 0x3D, 0x08, 0x42, 0x08, 0x48, 0x08, 0x4D, 0x08, 0x53, 0x08, 0x58, 0x08, 0x5D, 0x08, 0x62, 0x08, 0x67, 0x08, 0x6C, 0x08, 0x71, 0x08, 
 0x76, 0x08, 0x7B, 0x08, 0x81, 0x08, 0x86, 0x08, 0x8B, 0x08, 0x8F, 0x08, 0x94, 0x08, 0x99, 0x08, 0x9E, 0x08, 0xA2, 0x08, 0xA7, 0x08, 0xAC, 0x08, 0xB1, 0x08, 0xB7, 0x08, 0xBC, 0x08, 0xC0, 0x08, 0xC5, 0x08, 
 0xCB, 0x08, 0xD0, 0x08, 0xD5, 0x08, 0xDA, 0x08, 0xDF, 0x08, 0xE3, 0x08, 0xE8, 0x08, 0xEC, 0x08, 0xF1, 0x08, 0xF6, 0x08, 0xFB, 0x08, 0xFF, 0x08, 0x03, 0x09, 0x07, 0x09, 0x0C, 0x09, 0x10, 0x09, 0x15, 0x09, 
 0x19, 0x09, 0x1D, 0x09, 0x21, 0x09, 0x26, 0x09, 0x2A, 0x09, 0x2E, 0x09, 0x32, 0x09, 0x37, 0x09, 0x3B, 0x09, 0x40, 0x09, 0x44, 0x09, 0x48, 0x09, 0x4D, 0x09, 0x51, 0x09, 0x56, 0x09, 0x59, 0x09, 0x5D, 0x09, 
 0x61, 0x09, 0x66, 0x09, 0x6A, 0x09, 0x6F, 0x09, 0x73, 0x09, 0x77, 0x09, 0x7C, 0x09, 0x80, 0x09, 0x85, 0x09, 0x89, 0x09, 0x8D, 0x09, 0x91, 0x09, 0x95, 0x09, 0x99, 0x09, 0x9D, 0x09, 0xA1, 0x09, 0xA5, 0x09, 
 0xA9, 0x09, 0xAD, 0x09, 0xB0, 0x09, 0xB4, 0x09, 0xB8, 0x09, 0xBC, 0x09, 0xC0, 0x09, 0xC4, 0x09, 0xC7, 0x09, 0xCA, 0x09, 0xCE, 0x09, 0xD2, 0x09, 0xD6, 0x09, 0xD9, 0x09, 0xDD, 0x09, 0xE1, 0x09, 0xE4, 0x09, 
 0xE8, 0x09, 0xEC, 0x09, 0xF0, 0x09, 0xF3, 0x09, 0xF7, 0x09, 0xFA, 0x09, 0xFE, 0x09, 0x02, 0x0A, 0x05, 0x0A, 0x09, 0x0A, 0x0C, 0x0A, 0x10, 0x0A, 0x13, 0x0A, 0x17, 0x0A, 0x1A, 0x0A, 0x1D, 0x0A, 0x20, 0x0A, 
 0x23, 0x0A, 0x26, 0x0A, 0x2A, 0x0A, 0x2D, 0x0A, 0x31, 0x0A, 0x34, 0x0A, 0x37, 0x0A, 0x3B, 0x0A, 0x3E, 0x0A, 0x41, 0x0A, 0x45, 0x0A, 0x48, 0x0A, 0x4B, 0x0A, 0x4F, 0x0A, 0x52, 0x0A, 0x55, 0x0A, 0x58, 0x0A, 
 0x5B, 0x0A, 0x5F, 0x0A, 0x62, 0x0A, 0x65, 0x0A, 0x68, 0x0A, 0x6A, 0x0A, 0x6D, 0x0A, 0x6F, 0x0A, 0x72, 0x0A, 0x76, 0x0A, 0x79, 0x0A, 0x7C, 0x0A, 0x7F, 0x0A, 0x82, 0x0A, 0x85, 0x0A, 0x87, 0x0A, 0x8B, 0x0A, 
 0x8E, 0x0A, 0x91, 0x0A, 0x94, 0x0A, 0x97, 0x0A, 0x99, 0x0A, 0x9C, 0x0A, 0x9E, 0x0A, 0xA1, 0x0A, 0xA4, 0x0A, 0xA7, 0x0A, 0xAA, 0x0A, 0xAC, 0x0A, 0xAF, 0x0A, 0xB1, 0x0A, 0xB4, 0x0A, 0xB7, 0x0A, 0xBA, 0x0A, 
 0xBD, 0x0A, 0xC0, 0x0A, 0xC3, 0x0A, 0xC6, 0x0A, 0xC8, 0x0A, 0xCB, 0x0A, 0xCE, 0x0A, 0xD1, 0x0A, 0xD4, 0x0A, 0xD7, 0x0A, 0xD9, 0x0A, 0xDB, 0x0A, 0xDE, 0x0A, 0xE1, 0x0A, 0xE4, 0x0A, 0xE6, 0x0A, 0xE8, 0x0A, 
 0xEB, 0x0A, 0xED, 0x0A, 0xF0, 0x0A, 0xF2, 0x0A, 0xF5, 0x0A, 0xF7, 0x0A, 0xFA, 0x0A, 0xFD, 0x0A, 0xFF, 0x0A, 0x02, 0x0B, 0x04, 0x0B, 0x06, 0x0B, 0x08, 0x0B, 0x0A, 0x0B, 0x0D, 0x0B, 0x10, 0x0B, 0x12, 0x0B, 
 0x14, 0x0B, 0x16, 0x0B, 0x19, 0x0B, 0x1B, 0x0B, 0x1E, 0x0B, 0x20, 0x0B, 0x22, 0x0B, 0x24, 0x0B, 0x26, 0x0B, 0x29, 0x0B, 0x2B, 0x0B, 0x2D, 0x0B, 0x30, 0x0B, 0x32, 0x0B, 0x35, 0x0B, 0x37, 0x0B, 0x39, 0x0B, 
 0x3B, 0x0B, 0x3D, 0x0B, 0x40, 0x0B, 0x42, 0x0B, 0x44, 0x0B, 0x46, 0x0B, 0x49, 0x0B, 0x4B, 0x0B, 0x4D, 0x0B, 0x4F, 0x0B, 0x51, 0x0B, 0x53, 0x0B, 0x55, 0x0B, 0x57, 0x0B, 0x59, 0x0B, 0x5B, 0x0B, 0x5D, 0x0B, 
 0x5F, 0x0B, 0x61, 0x0B, 0x63, 0x0B, 0x65, 0x0B, 0x67, 0x0B, 0x69, 0x0B, 0x6B, 0x0B, 0x6C, 0x0B, 0x6E, 0x0B, 0x70, 0x0B, 0x72, 0x0B, 0x74, 0x0B, 0x76, 0x0B, 0x78, 0x0B, 0x7A, 0x0B, 0x7C, 0x0B, 0x7E, 0x0B, 
 0x80, 0x0B, 0x82, 0x0B, 0x84, 0x0B, 0x86, 0x0B, 0x88, 0x0B, 0x8B, 0x0B, 0x8C, 0x0B, 0x8E, 0x0B, 0x8F, 0x0B, 0x91, 0x0B, 0x94, 0x0B, 0x95, 0x0B, 0x97, 0x0B, 0x99, 0x0B, 0x9B, 0x0B, 0x9D, 0x0B, 0x9E, 0x0B, 
 0xA0, 0x0B, 0xA2, 0x0B, 0xA4, 0x0B, 0xA6, 0x0B, 0xA8, 0x0B, 0xA9, 0x0B, 0xAB, 0x0B, 0xAD, 0x0B, 0xAF, 0x0B, 0xB1, 0x0B, 0xB2, 0x0B, 0xB3, 0x0B, 0xB5, 0x0B, 0xB7, 0x0B, 0xBA, 0x0B, 0xBB, 0x0B, 0xBD, 0x0B, 
 0xBE, 0x0B, 0xC0, 0x0B, 0xC2, 0x0B, 0xC4, 0x0B, 0xC6, 0x0B, 0xC8, 0x0B, 0xC9, 0x0B, 0xCA, 0x0B, 0xCB, 0x0B, 0xCD, 0x0B, 0xCE, 0x0B, 0xD0, 0x0B, 0xD2, 0x0B, 0xD4, 0x0B, 0xD6, 0x0B, 0xD8, 0x0B, 0xD9, 0x0B, 
 0xDA, 0x0B, 0xDB, 0x0B, 0xDD, 0x0B, 0xDE, 0x0B, 0xE0, 0x0B, 0xE1, 0x0B, 0xE3, 0x0B, 0xE4, 0x0B, 0xE6, 0x0B, 0xE7, 0x0B, 0xE9, 0x0B, 0xEB, 0x0B, 0xEC, 0x0B, 0xED, 0x0B, 0xEF, 0x0B, 0xF0, 0x0B, 0xF2, 0x0B, 
 0xF3, 0x0B, 0xF4, 0x0B, 0xF6, 0x0B, 0xF8, 0x0B, 0xF9, 0x0B, 0xFB, 0x0B, 0xFC, 0x0B, 0xFD, 0x0B, 0xFF, 0x0B, 0x01, 0x0C, 0x02, 0x0C, 0x03, 0x0C, 0x04, 0x0C, 0x05, 0x0C, 0x06, 0x0C, 0x07, 0x0C, 0x09, 0x0C, 
 0x0B, 0x0C, 0x0C, 0x0C, 0x0E, 0x0C, 0x0F, 0x0C, 0x10, 0x0C, 0x11, 0x0C, 0x12, 0x0C, 0x14, 0x0C, 0x15, 0x0C, 0x17, 0x0C, 0x18, 0x0C, 0x1A, 0x0C, 0x1B, 0x0C, 0x1C, 0x0C, 0x1D, 0x0C, 0x1E, 0x0C, 0x1F, 0x0C, 
 0x21, 0x0C, 0x23, 0x0C, 0x24, 0x0C, 0x25, 0x0C, 0x26, 0x0C, 0x27, 0x0C, 0x29, 0x0C, 0x2A, 0x0C, 0x2B, 0x0C, 0x2C, 0x0C, 0x2D, 0x0C, 0x2E, 0x0C, 0x30, 0x0C, 0x30, 0x0C, 0x31, 0x0C, 0x32, 0x0C, 0x34, 0x0C, 
 0x35, 0x0C, 0x36, 0x0C, 0x38, 0x0C, 0x39, 0x0C, 0x3A, 0x0C, 0x3B, 0x0C, 0x3C, 0x0C, 0x3D, 0x0C, 0x3E, 0x0C, 0x40, 0x0C, 0x41, 0x0C, 0x42, 0x0C, 0x43, 0x0C, 0x44, 0x0C, 0x45, 0x0C, 0x46, 0x0C, 0x47, 0x0C, 
 0x48, 0x0C, 0x4A, 0x0C, 0x4B, 0x0C, 0x4B, 0x0C, 0x4C, 0x0C, 0x4D, 0x0C, 0x4E, 0x0C, 0x50, 0x0C, 0x51, 0x0C, 0x52, 0x0C, 0x53, 0x0C, 0x54, 0x0C, 0x55, 0x0C, 0x56, 0x0C, 0x57, 0x0C, 0x58, 0x0C, 0x59, 0x0C, 
 0x5A, 0x0C, 0x5B, 0x0C, 0x5B, 0x0C, 0x5C, 0x0C, 0x5D, 0x0C, 0x5E, 0x0C, 0x60, 0x0C, 0x61, 0x0C, 0x62, 0x0C, 0x63, 0x0C, 0x64, 0x0C, 0x64, 0x0C, 0x66, 0x0C, 0x67, 0x0C, 0x68, 0x0C, 0x69, 0x0C, 0x6A, 0x0C, 
 0x6B, 0x0C, 0x6C, 0x0C, 0x6D, 0x0C, 0x6D, 0x0C, 0x6F, 0x0C, 0x70, 0x0C, 0x71, 0x0C, 0x72, 0x0C, 0x72, 0x0C, 0x73, 0x0C, 0x74, 0x0C, 0x75, 0x0C, 0x75, 0x0C, 0x76, 0x0C, 0x77, 0x0C, 0x79, 0x0C, 0x7A, 0x0C, 
 0x7B, 0x0C, 0x7B, 0x0C, 0x7C, 0x0C, 0x7D, 0x0C, 0x7E, 0x0C, 0x7F, 0x0C, 0x7F, 0x0C, 0x81, 0x0C, 0x82, 0x0C, 0x83, 0x0C, 0x84, 0x0C, 0x84, 0x0C, 0x84, 0x0C, 0x85, 0x0C, 0x86, 0x0C, 0x87, 0x0C, 0x88, 0x0C, 
 0x89, 0x0C, 0x89, 0x0C, 0x8A, 0x0C, 0x8B, 0x0C, 0x8B, 0x0C, 0x8C, 0x0C, 0x8D, 0x0C, 0x8E, 0x0C, 0x8F, 0x0C, 0x90, 0x0C, 0x91, 0x0C, 0x92, 0x0C, 0x92, 0x0C, 0x93, 0x0C, 0x94, 0x0C, 0x94, 0x0C, 0x95, 0x0C, 
 0x96, 0x0C, 0x96, 0x0C, 0x97, 0x0C, 0x98, 0x0C, 0x99, 0x0C, 0x9A, 0x0C, 0x9B, 0x0C, 0x9B, 0x0C, 0x9B, 0x0C, 0x9C, 0x0C, 0x9D, 0x0C, 0x9E, 0x0C, 0x9E, 0x0C, 0x9F, 0x0C, 0xA0, 0x0C, 0xA1, 0x0C, 0xA2, 0x0C, 
 0xA3, 0x0C, 0xA3, 0x0C, 0xA4, 0x0C, 0xA4, 0x0C, 0xA5, 0x0C, 0xA6, 0x0C, 0xA7, 0x0C, 0xA7, 0x0C, 0xA8, 0x0C, 0xA9, 0x0C, 0xAA, 0x0C, 0xAA, 0x0C, 0xAB, 0x0C, 0xAC, 0x0C, 0xAC, 0x0C, 0xAD, 0x0C, 0xAD, 0x0C, 
 0xAE, 0x0C, 0xAF, 0x0C, 0xB0, 0x0C, 0xB0, 0x0C, 0xB1, 0x0C, 0xB1, 0x0C, 0xB1, 0x0C, 0xB2, 0x0C, 0xB4, 0x0C, 0xB5, 0x0C, 0xB5, 0x0C, 0xB5, 0x0C, 0xB6, 0x0C, 0xB6, 0x0C, 0xB7, 0x0C, 0xB7, 0x0C, 0xB8, 0x0C, 
 0xBA, 0x0C, 0xBB, 0x0C, 0xBB, 0x0C, 0xBB, 0x0C, 0xBC, 0x0C, 0xBC, 0x0C, 0xBD, 0x0C, 0xBD, 0x0C, 0xBE, 0x0C, 0xBE, 0x0C, 0xBF, 0x0C, 0xC0, 0x0C, 0xC1, 0x0C, 0xC1, 0x0C, 0xC2, 0x0C, 0xC3, 0x0C, 0xC3, 0x0C, 
 0xC4, 0x0C, 0xC4, 0x0C, 0xC4, 0x0C, 0xC5, 0x0C, 0xC5, 0x0C, 0xC6, 0x0C, 0xC6, 0x0C, 0xC6, 0x0C, 0xC7, 0x0C, 0xC7, 0x0C, 0xC8, 0x0C, 0xC9, 0x0C, 0xCA, 0x0C, 0xCB, 0x0C, 0xCB, 0x0C, 0xCC, 0x0C, 0xCC, 0x0C, 
 0xCD, 0x0C, 0xCD, 0x0C, 0xCD, 0x0C, 0xCD, 0x0C, 0xCE, 0x0C, 0xCF, 0x0C, 0xD0, 0x0C, 0xD0, 0x0C, 0xD1, 0x0C, 0xD2, 0x0C, 0xD3, 0x0C, 0xD3, 0x0C, 0xD4, 0x0C, 0xD4, 0x0C, 0xD4, 0x0C, 0xD4, 0x0C, 0xD5, 0x0C, 
 0xD5, 0x0C, 0xD6, 0x0C, 0xD6, 0x0C, 0xD7, 0x0C, 0xD7, 0x0C, 0xD8, 0x0C, 0xD9, 0x0C, 0xDA, 0x0C, 0xDA, 0x0C, 0xDA, 0x0C, 0xDA, 0x0C, 0xDA, 0x0C, 0xDB, 0x0C, 0xDB, 0x0C, 0xDC, 0x0C, 0xDD, 0x0C, 0xDD, 0x0C, 
 0xDD, 0x0C, 0xDD, 0x0C, 0xDE, 0x0C, 0xDE, 0x0C, 0xDF, 0x0C, 0xE0, 0x0C, 0xE0, 0x0C, 0xE0, 0x0C, 0xE1, 0x0C, 0xE2, 0x0C, 0xE3, 0x0C, 0xE3, 0x0C, 0xE4, 0x0C, 0xE4, 0x0C, 0xE4, 0x0C, 0xE4, 0x0C, 0xE4, 0x0C, 
 0xE5, 0x0C, 0xE5, 0x0C, 0xE6, 0x0C, 0xE6, 0x0C, 0xE6, 0x0C, 0xE6, 0x0C, 0xE7, 0x0C, 0xE8, 0x0C, 0xE9, 0x0C, 0xEA, 0x0C, 0xEA, 0x0C, 0xEA, 0x0C, 0xEA, 0x0C, 0xEA, 0x0C, 0xEB, 0x0C, 0xEC, 0x0C, 0xEC, 0x0C, 
 0xEC, 0x0C, 0xEC, 0x0C, 0xEC, 0x0C, 0xEC, 0x0C, 0xED, 0x0C, 0xEE, 0x0C, 0xEE, 0x0C, 0xEF, 0x0C, 0xEF, 0x0C, 0xEF, 0x0C, 0xEF, 0x0C, 0xEF, 0x0C, 0xF0, 0x0C, 0xF0, 0x0C, 0xF0, 0x0C, 0xF1, 0x0C, 0xF2, 0x0C, 
 0xF3, 0x0C, 0xF3, 0x0C, 0xF3, 0x0C, 0xF3, 0x0C, 0xF3, 0x0C, 0xF4, 0x0C, 0xF4, 0x0C, 0xF5, 0x0C, 0xF5, 0x0C, 0xF5, 0x0C, 0xF6, 0x0C, 0xF6, 0x0C, 0xF6, 0x0C, 0xF6, 0x0C, 0xF7, 0x0C, 0xF8, 0x0C, 0xF9, 0x0C, 
 0xFA, 0x0C, 0xFA, 0x0C, 0xFA, 0x0C, 0xFA, 0x0C, 0xFA, 0x0C, 0xFB, 0x0C, 0xFB, 0x0C, 0xFC, 0x0C, 0xFC, 0x0C, 0xFC, 0x0C, 0xFC, 0x0C, 0xFC, 0x0C, 0xFD, 0x0C, 0xFD, 0x0C, 0xFD, 0x0C, 0xFE, 0x0C, 0xFF, 0x0C, 
 0xFF, 0x0C, 0xFF, 0x0C, 0xFF, 0x0C, 0xFF, 0x0C, 0xFF, 0x0C, 0x00, 0x0D, 0x00, 0x0D, 0x01, 0x0D, 0x02, 0x0D, 0x03, 0x0D, 0x02, 0x0D, 0x02, 0x0D, 0x02, 0x0D, 0x02, 0x0D, 0x02, 0x0D, 0x03, 0x0D, 0x03, 0x0D, 
 0x03, 0x0D, 0x04, 0x0D, 0x04, 0x0D, 0x04, 0x0D, 0x05, 0x0D, 0x05, 0x0D, 0x05, 0x0D, 0x05, 0x0D, 0x05, 0x0D, 0x05, 0x0D, 0x06, 0x0D, 0x06, 0x0D, 0x06, 0x0D, 0x06, 0x0D, 0x07, 0x0D, 0x08, 0x0D, 0x08, 0x0D, 
 0x09, 0x0D, 0x09, 0x0D, 0x09, 0x0D, 0x09, 0x0D, 0x09, 0x0D, 0x09, 0x0D, 0x09, 0x0D, 0x0A, 0x0D, 0x0A, 0x0D, 0x0B, 0x0D, 0x0B, 0x0D, 0x0B, 0x0D, 0x0B, 0x0D, 0x0B, 0x0D, 0x0C, 0x0D, 0x0C, 0x0D, 0x0C, 0x0D, 
 0x0C, 0x0D, 0x0C, 0x0D, 0x0D, 0x0D, 0x0D, 0x0D, 0x0E, 0x0D, 0x0E, 0x0D, 0x0E, 0x0D, 0x0E, 0x0D, 0x0E, 0x0D, 0x0E, 0x0D, 0x0E, 0x0D, 0x0F, 0x0D, 0x0F, 0x0D, 0x0F, 0x0D, 0x10, 0x0D, 0x11, 0x0D, 0x11, 0x0D, 
 0x11, 0x0D, 0x11, 0x0D, 0x11, 0x0D, 0x12, 0x0D, 0x12, 0x0D, 0x12, 0x0D, 0x12, 0x0D, 0x12, 0x0D, 0x12, 0x0D, 0x13, 0x0D, 0x13, 0x0D, 0x13, 0x0D, 0x14, 0x0D, 0x14, 0x0D, 0x14, 0x0D, 0x14, 0x0D};
 */
    unsigned short fev1Val = 1137;
    unsigned short fev6Val = 3117;
    unsigned short fvcVal  = 3393;  // fev1/fvc = 0335
    unsigned short pefVal  = 1450;
    unsigned short fetVal  = 10000;
    short fev1z_val = -1500;   // Z score * 1000
    short fev1_lln_val = 2681; // LLN * 1000, 
    short fev1_percent_pred_val = 324;  // % predicted * 10
    unsigned long fvcAtsGradeVal = MDC_SPIRO_AST_QUAL_D;
    unsigned long fev1AtsGradeVal = MDC_SPIRO_AST_QUAL_D;

    #define AGE 71
    #define HEIGHT 1829
    #define WEIGHT 9072
    #define NO_OF_SAMPLES 500
    #define SAMPLE_SIZE 2
    unsigned short BLE_APPEARANCE                   = BLE_APPEARANCE_UNKNOWN;
    static unsigned char bluetoothAddress[]         = {0x03, 0xF1, 0x02, 0xE3, 0x4D, 0xAA}; // AA:4D:E3:02:F1:01 in little endian
    static unsigned char systemId[]                 = {0x03, 0xF1, 0x02, 0xFF, 0xFE, 0xE3, 0x4D, 0xAA};

    char *DEVICE_NAME                               = "Met Spirometer";
    unsigned short SPECIALIZATION                   = MDC_DEV_SPEC_PROFILE_SPIRO;
    static char *MODEL_NUMBER                       = "MET-SPIRO-234r";
    static char *MANUFACTURER_NAME                  = "MET Spirometry";
    static char *SERIAL_NUMBER                      = "snX-4956";               // The System Info serial number
    static char *FIRMWARE_VERSION                   = "fw90.9";                 // The System Info firmware version
    static char *HARDWARE_VERSION                   = "hw5.7.61";               // The System Info hardware version
    static char *SOFTWARE_VERSION                   = "sw0.0.5";                // The System Info software version

