brianreinhold/NordicPHDs/nRF52/ble_app_met_epoch/handleSpecializations.c
    static char *UDI_LABEL                          = "udi label";
    static char *UDI_DEV_ID                         = "udi device spirometer";
    static char *UDI_ISSUER_OID                     = "1.2.3.4.5.6.777";
    static char *UDI_AUTH_OID                       = "2.16.840.1.113883.3.24";

    s_MsmtGroupData *msmtGroupSpiroSessionData      = NULL;
    s_MsmtGroupData *msmtGroupSpiroSettingsData     = NULL;
    s_MsmtGroupData *msmtGroupSpiroSubSessionData   = NULL;
    s_MsmtGroupData *msmtGroupSpiroStreamData       = NULL;
    s_MsmtGroupData *msmtGroupSpiroManeuvData       = NULL;
    s_MsmtGroupData *msmtGroupSpiroSummaryData      = NULL;
    s_MsmtGroupData *msmtGroupSpiroSessionEndData   = NULL;

    unsigned short refs[1];
    unsigned short session_id;
    unsigned short sub_session_id;
    unsigned short fvc_ids[3];   // For msmts that are used in the final summary
    int fvc_id_index = 0;
    unsigned short fev1_ids[3];
    int fev1_id_index = 0;
    unsigned short settings_id[5];

    unsigned short spiro_sequence = 0;      // First dump settings, then stream, then maneuver, then summary

    // Spiro base variables
    short fev05_index                               = -1;
    short fev075_index                              = -1;
    short fev1_index                                = -1;
    short fev3_index                                = -1;
    short fev6_index                                = -1;
    short fvc_index                                 = -1;
    short pef_index                                 = -1;
    short fef25_index                               = -1;
    short fef50_index                               = -1;
    short fef75_index                               = -1;
    short fef25_75_index                            = -1;
    short fet_index                                 = -1;
    short tpef_index                                = -1;
    short extrap_index                              = -1;
    short temp_index                                = -1;
    short humid_index                               = -1;
    short airPress_index                            = -1;
    short fev1z_index                               = -1;
    short fev1_lln_index                            = -1;
    short fev1_percent_pred_index                   = -1;
    short fvcz_index                                = -1;
    short fvc_lln_index                             = -1;
    short fvc_percent_pred_index                    = -1;
    short fev1AtsGrade_index                        = -1;
    short fvcAtsGrade_index                         = -1;

    // Spiro settings variables
    short age_index                                 = -1;
    short weight_index                              = -1;
    short height_index                              = -1;
    short sex_index                                 = -1;
    short ethnicity_index                           = -1;
    // Spiro session variables
    short session_index                             = -1;
    short sub_session_index                         = -1;
    short session_end_index                         = -1;

    // Spiro streaming variables
    short flow_index                                = -1;
    short volume_index                              = -1;

#endif
#if (SCALE == 1)
    #define HEIGHT 1727         // 172.7 cm for setting (height in cm * 10) This will be sent as a setting (we have not yet defined how to transmit settings)
    unsigned short BLE_APPEARANCE = BLE_APPEARANCE_GENERIC_WEIGHT_SCALE;
    static unsigned char bluetoothAddress[]         = {0x06, 0xF1, 0x02, 0xE3, 0x4D, 0xAA}; // AA:4D:E3:02:F1:06 in little endian
    static unsigned char systemId[]                 = {0x06, 0xF1, 0x02, 0xFF, 0xFE, 0xE3, 0x4D, 0xAA};

    char *DEVICE_NAME                               = "Met Scale";  // Samsung refuses to connect if name is too short. This is too short. 'Met Weigh Scale' is okay
    unsigned short SPECIALIZATION                   = MDC_DEV_SPEC_PROFILE_SCALE;
    static char *MODEL_NUMBER                       = "MET-Scale-234r";
    static char *MANUFACTURER_NAME                  = "MET Scale Designers";
    static char *SERIAL_NUMBER                      = "snX-4956";               // The System Info serial number
    static char *FIRMWARE_VERSION                   = "fw90.9";                 // The System Info firmware version
    static char *HARDWARE_VERSION                   = "hw5.7.61";               // The System Info hardware version
    static char *SOFTWARE_VERSION                   = "sw0.0.5";                // The System Info software version

    static char *UDI_LABEL                          = "udi label";
    static char *UDI_DEV_ID                         = "udi device scale";
    static char *UDI_ISSUER_OID                     = "1.2.3.4.5.6.777";
    static char *UDI_AUTH_OID                       = "2.16.840.1.113883.3.24";
    s_MsmtGroupData *settingsGroupData              = NULL;      // This group will contain only one measurement, the height
    s_MsmtGroupData *msmtGroupScaleData             = NULL;      // This group will contain the weight and BMI measurements
    s_MsmtGroupData *msmtGroupOptimizedScaleData    = NULL;      // We don't use this
    unsigned short height_ref                       = 0;         // the msmt_id for the height setting measurement. The BMI will reference both height and the weight
    short mass_index                                = -1;        // The index of the weight measurement in the header. It will be the first measurement
    short height_index                              = -1;        // The index of the height measurement in the header. It is also the first measurement as the
                                                                 // settings are their own group. In this case we have only one setting.
    short bmi_index                                 = -1;        // Index of the BMI in the header. This will be the second measurement in our case.
    unsigned short scale_sequence                   = 0;         // This is a helper variable to know whether or not we have sent the setting. We need to define
                                                                 // how settings are to be sent.
#endif
#if (THERMOMETER == 1)
    unsigned short BLE_APPEARANCE = BLE_APPEARANCE_THERMOMETER_EAR;
    static unsigned char bluetoothAddress[]         = {0x05, 0xF1, 0x02, 0xE3, 0x4D, 0xAA}; // AA:4D:E3:02:F1:05 in little endian
    static unsigned char systemId[]                 = {0x05, 0xF1, 0x02, 0xFF, 0xFE, 0xE3, 0x4D, 0xAA};

    char *DEVICE_NAME                               = "Met Ear Therm";
    unsigned short SPECIALIZATION                   = MDC_DEV_SPEC_PROFILE_TEMP;
    static char *MODEL_NUMBER                       = "MET-Temp-234r";
    static char *MANUFACTURER_NAME                  = "MET Ear Thermometer";
    static char *SERIAL_NUMBER                      = "snX-4956";               // The System Info serial number
    static char *FIRMWARE_VERSION                   = "fw90.9";                 // The System Info firmware version
    static char *HARDWARE_VERSION                   = "hw5.7.61";               // The System Info hardware version
    static char *SOFTWARE_VERSION                   = "sw0.0.5";                // The System Info software version

