brianreinhold/NordicPHDs/nRF52/ble_app_met_epoch/handleSpecializations.c
    static char *UDI_LABEL                          = "udi label";
    static char *UDI_DEV_ID                         = "udi device thermometer";
    static char *UDI_ISSUER_OID                     = "1.2.3.4.5.6.777";
    static char *UDI_AUTH_OID                       = "2.16.840.1.113883.3.24";
    s_MsmtGroupData *msmtGroupTempData              = NULL;
    s_MsmtGroupData *msmtGroupOptimizedTempData     = NULL;
    short temp_index                                = -1;
    short ambient_index                             = -1;
#endif

/** ================================================ SEQUENCE ===========================
    The order of calling these methods is
        1. configureSpecializations(void): This is called at program start prior to initializing Bluetooth to set up the data array 
            templates to be sent to the client.
        2. generateAndAddStoredMsmt(unsigned long long timeStampMsmt, unsigned long long timeStamp, unsigned short numberOfStoredMsmtGroups): This method is called
            currently by a button press (Button 4 on the DK). This creates a fake measurement set for the given specialization and
            stores it. It's simulating real data coming from a sensor and being stored because the device is not online. Each button
            press generates a measurement set. For the spirometer, this button does nothing. Stored data is not generated. For the
            Glucose, only stored data is generated. No live data is generated.
        3. handleSpecializationsOnSetTime(unsigned short numberOfStoredMsmtGroups, long long diff, unsigned short timeSync): This method
            is called if your device supports the set time operation and a set time is judged as needed by the client. This updates
            the epoch base and the time sync state of the current time (and any timestamps). Any stored data's time stamps are also
            re-adjusted appropriately. There is no date-time-adjustment in this model.
        4. sendStoredSpecializationMsmts(unsigned short stored_count): This method is called if there is stored data and the client
            asks to retrieve it. The stored data is queued and then sent until all gone.
        4. bool encodeSpecializationMsmts(void *data): This method is called at any time there is data in the queue. In the main loop
            queued data are obtained and this method is called. If the method succeeds, the measurement is dequeued and the send
            flag set. The main loop calls the send-data method if the send flag is set.
        5. void deleteStoredSpecializationMsmts(void): This method is called if there is stored data. Typcially it is called after
            the client uploads the stored data unless, for some reason, it does not want to delete it.
        6. generateLiveDataForSpecializations(unsigned long live_data_count, unsigned long long timeStampMsmt, unsigned long timeStamp): This method actually has
            been called since program startup but since live data has not been flagged as permitted, the method just returns. Otherwise
            it generates fake data. This method is supposed to simulate events coming from the sensor while connected. The data is 
            generated and then queued. The same procedure happens here as with the sending of stored data.
        7. cleanUpSpecializations(void): This method is called at program end. It frees all the allocated data arrays created in the
            the configureSpecializations() method
 *
 */

unsigned char *getBtAddress(void)
{
    return bluetoothAddress;
}

/**
 * This method configures and creates the data arrays to be sent to the client.
 * We call this method at start up before any connection or advertising takes place.
 *
 * Creates the system info, current time info, and measurement group data arrays that are sent over
 * the airwaves. These data array templates (except for the SystemInfo) need to be populated
 * with the current data before sending. For example, the current time has to be entered into
 * the current time info data array before sending to the PHG. The same for the measurement
 * data arrays; they will need to be populated with time stamps and values as they are received
 * from the sensors. There are methods to populate the data arrays with that sensor data.
 */
void configureSpecializations(void)
{
    bool result;
    unsigned char group_id = 1;

    // NOTE: We are bad boys and do not check the 'result' value. If false, something went bad, almost always due to
    // implementation bugs.

    // Now to configure our MET PHD information
    // Create the time info data buffer,  but first establish our MetTime which we
    // will update as needed.
    #if (USES_TIMESTAMP == 1)
        // Method allocates the s_MetTime structure and populates it with the information
        // it can at the moment.
        factor = 1000L; // 10000L for MET_TIME_FLAG_SUPPORTS_TENTHS_MILLIS
                        // 1000L for MET_TIME_FLAG_SUPPORTS_MILLISECONDS
                        // 100L for MET_TIME_FLAG_SUPPORTS_HUNDREDTHS
                        // 10L for MET_TIME_FLAG_SUPPORTS_TENTHS
                        // 1L for MET_TIME_FLAG_SUPPORTS_SECONDS
        result = createMetTime(&sMetTime,           // Structure to be allocated. The initial pointer must be NULL. Note that
                                                    // we pass in a pointer to the pointer so when the method completes, the
                                                    // structure will be populated.
                      MET_TIME_OFFSET_UNSUPPORTED,  // We do not support an offset to UTC. Most devices don't!
                      MET_TIME_FLAGS_EPOCH_TIME,    // Clock type being used
                      MET_TIME_FLAG_SUPPORTS_MILLISECONDS, // indicates our clock has a resolution of milliseconds. 
                      MDC_TIME_SYNC_NONE);          // The initial synchronization state of the clock. We set it to none which
                                                    // tells the client to set the time if we choose to support the set time.
                                                    // Note that this standard requires that all devices that support a time
                                                    // stamp must be able to report their current time. Given that, the client
                                                    // can ALWAYs correct the times to the correct time IF the client is synchronized,
                                                    // which we assume is the case, even if the device is never synchronized.
        result = createTimeInfo(&sTimeInfo,         // A pointer to an s_TimeInfo structure which we will use to create the sTimeInfoData
                                                    // struct containing the data array to be sent to the client when the client asks
                                                    // for the current time info. It needs to be NULL when passed in. Space is allocated
                                                    // for the structure and is populated by this method.
                            sMetTime,               // A pointer to the s_MetTime struct that we populated earlier. If we don't want to 
                                                    // support a time clock at all, this parameter shall be NULL.
                            true);                  // When 'true' we support the set time operation. This value is ignored for relative times
                                                    // and no times.
        result = createCurrentTimeDataBuffer(&sTimeInfoData, sTimeInfo);  // This method creates the time info data array structure from 
                                                                      // the s_TimeInfo struct. We will need to populate the current time
                                                                      // part of this array when the client asks for it. That is done by
                                                                      // various update methods.
                                                                      // Resources need to be cleaned up at program termination. We do it on shutdown
        cleanUpTimeInfo(&sTimeInfo);                // We no longer need the s_TimeInfo structure now that we have created the time info data array.
                                                    // All future updates are done on that data array. So free all it's resources.
    #endif

