brianreinhold/NordicPHDs/nRF52/ble_app_met_epoch/handleSpecializations.c
    // Create the system info data buffer. Here is where we set info like the serial number, specialization, firmware, ect. The idea is to
    // create the system info data buf to get sent to client when it asks for it. The nice thing here is that these values are static, so once
    // created, we are done. No updaters are needed.
    result = createSystemInfo(&systemInfo, 1);              // Allocates and populates the s_SystemInfo struct. We pass in a pointer
                                                            // to a pointer intialized to NULL. The second parameter is the number of specializations
                                                            // supported by the device. In most cases it will be 1.
    result = addSpecialization(&systemInfo, SPECIALIZATION, 2); // Add the specialization and specialization version to system info
    result = setSystemIdentifierByte(&systemInfo, systemId);    // Add the system id to the system info
    result = setRequiredSystemInfoStrings(&systemInfo, MANUFACTURER_NAME, MODEL_NUMBER);    // Add the manufacturer name and model number
                                                                                            // These fields are generally required in most circumstances
                                                                                            // but if this method is not called there will be no failure.
                                                                                            // PLease add these fields!
    result = setRegulationStatus(&systemInfo,     // Set the regulation status.
                                 true,            // If true, a regulation status entry will be added.
                                 false);          // If true, the regulation status is reported as regulated. Ignored if no regulation status is present.
    result = setOptionalSystemInfoStrings(&systemInfo,       // Sets the serial number and the firmware, hardware, and software versions.
                                        SERIAL_NUMBER,       // serial number
                                        FIRMWARE_VERSION,    // firmware version
                                        HARDWARE_VERSION,    // hardware version
                                        SOFTWARE_VERSION);   // software version

    result = setUdi(&systemInfo, UDI_LABEL, UDI_DEV_ID, UDI_ISSUER_OID, UDI_AUTH_OID);
    result = createSystemInfoData(&systemInfoData, systemInfo); // Now we create the data array. We will need to clean this up at termination
    cleanUpSystemInfo(&systemInfo);     // Now we can cleanup and free the resources taken by the s_SystemInfo. We don't need it anymore.


    #if (BP_CUFF == 1)
        // Create the msmt data group      These structures will be used to create the data array to be sent on the wire and then be freed.
        s_MsmtGroup *msmtGroup = NULL;  // structure to hold the msmt group set up
        s_MetMsmt *bp = NULL;           // structure to hold the blood pressure set up
        s_MetMsmt *pr = NULL;           // structure to hold the pulse rate set up
        s_MetMsmt *status = NULL;       // Structure to hold the status set up
        s_Compound compounds[3];        // The Blood pressure measurement is a compound so we need to provide the sub types. We use s_Compound for this
        compounds[0].subType = MDC_PRESS_BLD_NONINV_SYS;    // We only need to provide the sub-type MDC codes in the order we want - first is systolic
        compounds[1].subType = MDC_PRESS_BLD_NONINV_DIA;    // then diastolic
        compounds[2].subType = MDC_PRESS_BLD_NONINV_MEAN;   // then mean
        result = createMsmtGroup(&msmtGroup,    // Now allocate the measurement group and configure it
                                 (USES_TIMESTAMP == 1),          // When true we will use time stamps
                                 3,             // We will have (up to) three measurements in the group, bp, pr, and status
                                 group_id++);   // The group id is only used for optimization which we don't do, but for consistency for the
                                                // client one will always exist. It has to be unique for the connection. In this case we only have
                                                // one measurement group. Most basic devices will only have one.
                                                // There are no additional fields to add to the group. For example, supplemental types. Any such
                                                // field added here would have to be common for all measurements in the group.
        result = createCompoundNumericMsmt(&bp,                     // Configure the blood pressure measurement which is a compound
                                           MDC_PRESS_BLD_NONINV,    // Provide the overall type for the compound
                                           true,                    // When true, the measurement values are going to use 2-byte SFLOATs instead
                                                                    // of 4-byte FLOATs. This resolution is good enough for the typical bp measurements.
                                           MDC_DIM_MMHG,            // The units of the blood pressure, here millimeters of Hg
                                           3,                       // The number of components in our compound.
                                           compounds);              // The array of compounds (has the sub types). The values are added in updaters
                                                                    // when we get the data from the sensor.
        result = setMetMsmtSupplementalTypes(&bp, 1);   // We are going to add a supplemental type to the blood pressure measurement. This supplemental
                                                        // type will indicate the measurement is taken on the upper arm. After we create the data array
                                                        // We will update the array with the MDC code MDC_UPEXT_ARM_UPPER. We will do it here since it is
                                                        // assumed that it does not change during the connection.
        bp_index = addMetMsmtToGroup(bp, &msmtGroup);   // Now we add the bp measurement to the group. The important thing here for the application is
                                                        // the returned bp_index. The application will need that value in order to update the data array
                                                        // with the bp values received from the sensor.

        result = createNumericMsmt(&pr,                     // Now we add the pulse rate which is a simple numeric. Much simpler.
                                   MDC_PULS_RATE_NON_INV,   // This is the MDC code giving the type of measurement
                                   true,                    // When true, the measurement values are going to be 2-byte SFLOATS
                                   MDC_DIM_BEAT_PER_MIN);   // The MDC code for the measurement units - beats per minute.
        pr_index = addMetMsmtToGroup(pr, &msmtGroup);       // Add this measurement to the group. Again the application will need the pr_index
                                                            // in order to update the data array with pr data from the sensor

        result = createBitEnumMsmt(&status,                                 // The status measurement which is a special measurement type that
                                                                            // that can contain up to 16 simultaneous events. Each event is represented
                                                                            // by a bit in a 16-bit number. For the bp standard, only six different
                                                                            // status events are defined and they are all events, not states.
                                     2,                                     // Number of bytes making up the BITs (2) - previously BITS 16
                                     MDC_BLOOD_PRESSURE_MEASUREMENT_STATUS, // This is the MDC code indicating that this is a BP status measurement
                                     BP_STATUS_STATES,                      // This value indicates which of the bits are events (0) or states (1).
                                                                            // The bit positions correspond to the bit positions of the msmt.
                                                                            // In the BP cuff, there are only events. So the value is 0 (all bits are 0).
                                     BP_STATUS_ALL_SUPPORTED);              // This value gives which of the 16-bits are supported. For the BP standard
                                                                            // only bits 0 - 5 are defined. Note that bit 0 is the HIGH order bit!!!
                                                                            // The value of this integer is 1111 1000 0000 0000 or 0xF800
        result = setMetMsmtRefs(&status, 2);                    // This method add references to status measurement. The reference will point to the
                                                                // measurement(s) this status event effects. In this case that would be the bp and pr.
                                                                // So when we update the status event, we will call an update method to add the reference
                                                                // (msmt_id) of the BP and PR measurements that were associated with these status events.
        status_index = addMetMsmtToGroup(status, &msmtGroup);   // Add the status event measurement to the group. Again, the status_index is needed to
                                                                // update the data array with the events and the references.

