brianreinhold/NordicPHDs/nRF52/ble_app_met_epoch/handleSpecializations.c
        result = createMsmtGroupDataArray(&msmtGroupBpData,     // Now we create the measurement group data array structure.
                                          msmtGroup,            // Pass in the measurement group to populate this data rray structure
                                          sMetTime,             // Pass in the s_MetTime structure to populate the static parts of the time stamp
                                                                // If there is no time stamp, this parameter is NULL.
                                          PACKET_TYPE_NORMAL);  // This determines whether or not this is an optimization packet. Its not. Its a normal
                                                                // packet. THis is the 90% use case. No one need use anything else, actually.
                                                                // Now within this structure we have the byte data array to send to the client. All
                                                                // static fields are filled in. The measurement values are, however, still empty. They
                                                                // are populated at the time we get sensor data with the update methods and the x_index
                                                                // parameters.
        result = updateDataMetMsmtSupplementalTypes(&msmtGroupBpData, bp_index,
                                                                       MDC_UPEXT_ARM_UPPER, 0); // As stated we are going to add the code for the location
                                                                                                // of the BP cuff once now, as we are not expecting it to
                                                                                                // change during the connection. Of course, most devices
                                                                                                // probably wont add this information unless, for some reason
                                                                                                // it could change and be indicated by a UI.
        // BUT NOT EVERY MEASUREMENT WILL HAVE STATUS EVENTS!! In fact we hope that none do since a status event means some type of problem like too much
        // body motion or incorrect position or whatever. So how do we deal with no status?
        // There are two ways
        //    1: easy way cop-out. Set the status value to zero
        //    2: better way. Call a special method that pops the last measurement off the group. Thus when the packet is sent, the last measurement in
        //       the packet is NOT sent. When you need to send status events, call a method to push the last measurement back into the group and then
        //       call the appropriate update method on that measurement.
        // Thse pop and push methods actually just reset some of the fields in the data packet, they do not remove the sequence of bytes at the
        // end of the group that represent the last measurement in the group. Readjusting some length fields and number of measurements does the trick!

        cleanUpMsmtGroup(&msmtGroup); // Now that we have gotten our data array we do not need the configuration structure anymore. Calling this cleanup
                                      // method also frees the memory allocated for all the measurement set up structures that we added to the group. So
                                      // we do not need to free them UNLESS we did not add them to the msmtGroup.
    #endif  // BP cuff


    #if (PULSE_OX == 1)
        // Pulse Ox
        // device and sensor status measurement
        #define PO_DEV_STATUS_EXT_DISPLAY_ONGOING 1
        #define PO_DEV_STATUS_EQUIP_MALFUNCTION_DETECTED 2
        #define PO_DEV_STATUS_SIGNAL_PROCESS_IRREG_DETECTED 4
        #define PO_DEV_STATUS_INADEQUATE_SIGNAL_DETECTED 8
        #define PO_DEV_STATUS_POOR_SIGNAL_DETECTED 16
        #define PO_DEV_STATUS_LOW_PERFUSION_DETECTED 32
        #define PO_DEV_STATUS_ERRATIC_SIGNAL_DETECTED 64
        #define PO_DEV_STATUS_NON_PULSATILE_SIGNAL_DETECTED 128
        #define PO_DEV_STATUS_QUEST_PULSE_DETECTED 256
        #define PO_DEV_STATUS_SIGNAL_ANALYSIS_ONGOING 512
        #define PO_DEV_STATUS_SENSOR_INTERFERENCE_DETECTED 1024
        #define PO_DEV_STATUS_SENSOR_NOT_CONNECTED_TO_USER 2048
        #define PO_DEV_STATUS_UNKNOWN_SENSOR_DETECTED 4096
        #define PO_DEV_STATUS_SENSOR_DISPLACED 8192
        #define PO_DEV_STATUS_SENSOR_MALFUNCTIONING 16384
        #define PO_DEV_STATUS_SENSOR_DISCONNECTED 32768

        // Create the msmt data group for SPOT measurements
        s_MsmtGroup *msmtGroup = NULL;
        s_MetMsmt *spo2 = NULL;
        s_MetMsmt *pr = NULL;
        s_MetMsmt *qual = NULL;
        result = createMsmtGroup(&msmtGroup, (USES_TIMESTAMP == 1), 3, group_id++); // 3 msmts - SpO2, PR, Qual
        result = setHeaderSupplementalTypes(&msmtGroup, 1);
        result = createNumericMsmt(&spo2, MDC_PULS_OXIM_SAT_O2, true, MDC_DIM_PERCENT);
        spo2_index = addMetMsmtToGroup(spo2, &msmtGroup);
        result = createNumericMsmt(&pr, MDC_PULS_OXIM_PULS_RATE, true, MDC_DIM_BEAT_PER_MIN);
        pr_index = addMetMsmtToGroup(pr, &msmtGroup);
        result = createNumericMsmt(&qual, MDC_SAT_O2_QUAL, true, MDC_DIM_PERCENT);
        qual_index = addMetMsmtToGroup(qual, &msmtGroup);
        result = createMsmtGroupDataArray(&msmtGroupSpotData, msmtGroup, sMetTime, PACKET_TYPE_NORMAL);
        updateDataHeaderSupplementalTypes(&msmtGroupSpotData, MDC_MODALITY_SPOT, 0);
        cleanUpMsmtGroup(&msmtGroup); // cleans up any allocated data -  we only need the data array now

        spo2 = NULL;
        pr = NULL;
        qual = NULL;

        // Now for the continuous
        result = createMsmtGroup(&msmtGroup, false, 3, group_id); // 3 msmts - SpO2, PR, Qual
        result = createNumericMsmt(&spo2, MDC_PULS_OXIM_SAT_O2, true, MDC_DIM_PERCENT);
        spo2_cont_index = addMetMsmtToGroup(spo2, &msmtGroup);
        result = createNumericMsmt(&pr, MDC_PULS_OXIM_PULS_RATE, true, MDC_DIM_BEAT_PER_MIN);
        pr_cont_index = addMetMsmtToGroup(pr, &msmtGroup);
        result = createNumericMsmt(&qual, MDC_SAT_O2_QUAL, true, MDC_DIM_PERCENT);
        qual_cont_index = addMetMsmtToGroup(qual, &msmtGroup);
        #if (SEND_OPTIMIZED == 1)
            result = createMsmtGroupDataArray(&msmtGroupContData, msmtGroup, NULL, PACKET_TYPE_OPTIMIZED_FIRST);
            result = createMsmtGroupDataArray(&msmtGroupOptimizedContData, msmtGroup, NULL, PACKET_TYPE_OPTIMIZED_FOLLOWS);
        #else
            result = createMsmtGroupDataArray(&msmtGroupContData, msmtGroup, NULL, PACKET_TYPE_NORMAL);
        #endif
        cleanUpMsmtGroup(&msmtGroup); // cleans up any allocated data - we only need the data array now
    #endif  // Pulse ox
    #if (GLUCOSE == 1)
        s_MsmtGroup *glucoseGroup = NULL;
        s_MetMsmt *conc = NULL;
        s_MetMsmt *meds = NULL;
        s_MetMsmt *carbs = NULL;
        s_MetMsmt *exer = NULL;
        result = createMsmtGroup(&glucoseGroup, (USES_TIMESTAMP == 1), 4, group_id++); // 4 msmts
        result = createNumericMsmt(&conc, MDC_CONC_GLU_UNDETERMINED_PLASMA, true, MDC_DIM_MILLI_G_PER_DL);
        result = setMetMsmtSupplementalTypes(&conc, 4);
        conc_index = addMetMsmtToGroup(conc, &glucoseGroup);
        result = createNumericMsmt(&meds, MDC_CTXT_MEDICATION, true, MDC_DIM_INTL_UNIT);
        result = setMetMsmtSupplementalTypes(&meds, 1);
        meds_index = addMetMsmtToGroup(meds, &glucoseGroup);
        result = createNumericMsmt(&carbs, MDC_CTXT_GLU_CARB, true, MDC_DIM_G);
        result = setMetMsmtSupplementalTypes(&carbs, 1);
        carbs_index = addMetMsmtToGroup(carbs, &glucoseGroup);
        result = createNumericMsmt(&exer, MDC_CTXT_GLU_EXERCISE, true, MDC_DIM_PERCENT);
        // TODO - make this observational with an updateData...
        result = setMetMsmtDuration(&exer);
        exer_index = addMetMsmtToGroup(exer, &glucoseGroup);
        result = createMsmtGroupDataArray(&msmtGroupGlucData, glucoseGroup, sMetTime, PACKET_TYPE_NORMAL);
        s_MderFloat mder;
        mder.exponent = 0;
        mder.mantissa = 3600;
        mder.mderFloatType = MDER_FLOAT;
        mder.specialValue = MDER_NUMBER;
        updateDataMetMsmtDuration(&msmtGroupGlucData, exer_index, &mder);
        cleanUpMsmtGroup(&glucoseGroup);
    #endif
    
    #if (HEART_RATE == 1)
        s_MsmtGroup *hrGroup = NULL;
        s_MetMsmt *hrMsmt = NULL;
        createMsmtGroup(&hrGroup, (USES_TIMESTAMP == 1), 1, group_id);
        createNumericMsmt(&hrMsmt, MDC_ECG_HEART_RATE, true, MDC_DIM_BEAT_PER_MIN);
        hr_index = addMetMsmtToGroup(hrMsmt, &hrGroup);
        #if (SEND_OPTIMIZED == 1)
            result = createMsmtGroupDataArray(&msmtGroupHrData, hrGroup, sMetTime, PACKET_TYPE_OPTIMIZED_FIRST);
            result = createMsmtGroupDataArray(&msmtGroupHrOptimizedData, hrGroup, sMetTime, PACKET_TYPE_OPTIMIZED_FOLLOWS);
        #else
            createMsmtGroupDataArray(&msmtGroupHrData, hrGroup, sMetTime, PACKET_TYPE_NORMAL);
        #endif
        cleanUpMsmtGroup(&hrGroup);
    #endif

    #if (SPIROMETER == 1)
        spiro_sequence = 0;
        // Going to load all the data here and send it in chunks on the 'live' command and then stop.
        // The only update will be the time stamps
        s_MsmtGroup *spiroSettingsGroup = NULL;
        s_MetMsmt *age = NULL;
        s_MetMsmt *weight = NULL;
        s_MetMsmt *height = NULL;
        s_MetMsmt *sex = NULL;
        s_MetMsmt *ethnicity = NULL;

        s_MsmtGroup *spiroSessionGroup = NULL;
        s_MetMsmt *session = NULL;

