brianreinhold/NordicPHDs/nRF52/ble_app_met_epoch/handleSpecializations.c
        s_MsmtGroup *spiroSubSessionGroup = NULL;
        s_MetMsmt *sub_session = NULL;

        s_MsmtGroup *spiroStreamingGroup = NULL;
        s_MetMsmt *volume = NULL;
        s_MetMsmt *flow = NULL;

        s_MsmtGroup *spiroManeuvGroup = NULL;
        s_MetMsmt *fev05 = NULL;
        s_MetMsmt *fev075 = NULL;
        s_MetMsmt *fev1 = NULL;
        s_MetMsmt *fev3 = NULL;
        s_MetMsmt *fev6 = NULL;
        s_MetMsmt *fvc = NULL;
        s_MetMsmt *pef = NULL;
        s_MetMsmt *fef25 = NULL;
        s_MetMsmt *fef50 = NULL;
        s_MetMsmt *fef75 = NULL;
        s_MetMsmt *fef25_75 = NULL;
        s_MetMsmt *fet = NULL;
        s_MetMsmt *tpef = NULL;
        s_MetMsmt *extrap = NULL;
        s_MetMsmt *temp = NULL;
        s_MetMsmt *humid = NULL;
        s_MetMsmt *airPress = NULL;
        s_MetMsmt *fev1z = NULL;
        s_MetMsmt *fev1_lln = NULL;
        s_MetMsmt *fev1_percent_pred = NULL;

        s_MsmtGroup *spiroSummaryGroup = NULL;
        s_MetMsmt *fvcAtsGrade = NULL;
        s_MetMsmt *fev1AtsGrade = NULL;

        s_MsmtGroup *spiroSessionEndGroup = NULL;
        s_MetMsmt *sessionEnd = NULL;

        // session
        if (createMsmtGroup(&spiroSessionGroup, (USES_TIMESTAMP == 1), 1, group_id++)) // 1 msmt
        {
            if (createCodedMsmt(&session, MDC_DIAG_SESSION_SPIRO))
            {
                session_index = addMetMsmtToGroup(session, &spiroSessionGroup);
                if (createMsmtGroupDataArray(&msmtGroupSpiroSessionData, spiroSessionGroup, sMetTime, PACKET_TYPE_NORMAL))
                {
                    session_id = msmt_id;
                    updateDataCoded(&msmtGroupSpiroSessionData, session_index, MDC_START, msmt_id++);
                }
            }
            cleanUpMsmtGroup(&spiroSessionGroup);
        }

        // settings
        result = createMsmtGroup(&spiroSettingsGroup,
                                    (USES_TIMESTAMP == 1),       // has time stamps if true
                                        5,      // number of measurements
                                    group_id++);
        result = setHeaderOptions(&spiroSettingsGroup,
                                    true,       // are settings
                                    false,      // has person id
                                    0);         // person id
        result = setHeaderRefs(&spiroSettingsGroup, 1);
        result = createNumericMsmt(&age, MDC_HF_AGE, true, MDC_DIM_YR);
        result = createNumericMsmt(&weight, MDC_MASS_BODY_ACTUAL, false, MDC_DIM_KILO_G);
        result = createNumericMsmt(&height, MDC_LEN_BODY_ACTUAL, false, MDC_DIM_CENTI_M);
        result = createCodedMsmt(&ethnicity, MDC_ETHNICITY);
        result = createCodedMsmt(&sex, MDC_BIRTH_SEX);
        age_index = addMetMsmtToGroup(age, &spiroSettingsGroup);
        weight_index = addMetMsmtToGroup(weight, &spiroSettingsGroup);
        height_index = addMetMsmtToGroup(height, &spiroSettingsGroup);
        ethnicity_index = addMetMsmtToGroup(ethnicity, &spiroSettingsGroup);
        sex_index = addMetMsmtToGroup(sex, &spiroSettingsGroup);
        result = createMsmtGroupDataArray(&msmtGroupSpiroSettingsData, spiroSettingsGroup, sMetTime, PACKET_TYPE_NORMAL);
        updateDataHeaderRefs(&msmtGroupSpiroSettingsData, session_id, 0);

        s_MderFloat mder;
        mder.exponent = 0;
        mder.mantissa = AGE;
        mder.mderFloatType = MDER_SFLOAT;
        mder.specialValue = MDER_NUMBER;
        settings_id[0] = msmt_id;
        updateDataNumeric(&msmtGroupSpiroSettingsData, age_index, &mder, msmt_id++);
        mder.exponent = -2;
        mder.mantissa = WEIGHT;
        mder.mderFloatType = MDER_FLOAT;
        settings_id[1] = msmt_id;
        updateDataNumeric(&msmtGroupSpiroSettingsData, weight_index, &mder, msmt_id++);
        mder.exponent = -1;
        mder.mantissa = HEIGHT;
        mder.mderFloatType = MDER_FLOAT;
        settings_id[2] = msmt_id;
        updateDataNumeric(&msmtGroupSpiroSettingsData, height_index, &mder, msmt_id++);
        settings_id[3] = msmt_id;
        updateDataCoded(&msmtGroupSpiroSettingsData, ethnicity_index, MDC_ETHNICITY_WHITE, msmt_id++);
        settings_id[4] = msmt_id;
        updateDataCoded(&msmtGroupSpiroSettingsData, sex_index, MDC_BIRTH_SEX_MALE, msmt_id++);
        cleanUpMsmtGroup(&spiroSettingsGroup);

        // sub session
        result = createMsmtGroup(&spiroSubSessionGroup, (USES_TIMESTAMP == 1), 1, group_id++); // 1 msmt
        setHeaderRefs(&spiroSubSessionGroup, 1 );
        result = createCodedMsmt(&sub_session, MDC_DIAG_SUB_SESSION_SPIRO_MANEUVER);
        sub_session_index = addMetMsmtToGroup(sub_session, &spiroSubSessionGroup);
        createMsmtGroupDataArray(&msmtGroupSpiroSubSessionData, spiroSubSessionGroup, sMetTime, PACKET_TYPE_NORMAL);
        cleanUpMsmtGroup(&spiroSubSessionGroup);

        // streaming data
        if (createMsmtGroup(&spiroStreamingGroup, (USES_TIMESTAMP == 1), 1, group_id++)) // 1 msmt
        {
            setHeaderRefs(&spiroStreamingGroup, 1 );
            s_MderFloat period;
            period.exponent = -3;
            period.mantissa = 10;  // 10 milliseconds; 0.01 seconds
            period.mderFloatType = MDER_FLOAT;
            period.specialValue = MDER_NUMBER;
            s_MderFloat scaleFactor;
            scaleFactor.exponent = 0;
            scaleFactor.mantissa = 1;  // raw data will be milliliters
            scaleFactor.mderFloatType = MDER_FLOAT;
            scaleFactor.specialValue = MDER_NUMBER;
            s_MderFloat offset;
            offset.exponent = 0;
            offset.mantissa = 0;  // raw data will be milliliters
            offset.mderFloatType = MDER_FLOAT;
            offset.specialValue = MDER_NUMBER;
          //  result = createRtsaMsmt(&volume, MDC_VOL_AWAY, MDC_DIM_MILLI_L, &period, &scaleFactor, &offset, NO_OF_SAMPLES, SAMPLE_SIZE);
            if (createRtsaMsmt(&flow, MDC_FLOW_AWAY, MDC_DIM_MILLI_L_PER_SEC, &period, &scaleFactor, &offset, NO_OF_SAMPLES, SAMPLE_SIZE))
            {
              //  volume_index = addMetMsmtToGroup(volume, &spiroStreamingGroup);
                flow_index = addMetMsmtToGroup(flow, &spiroStreamingGroup);
                createMsmtGroupDataArray(&msmtGroupSpiroStreamData, spiroStreamingGroup, sMetTime, PACKET_TYPE_NORMAL);
            }
            cleanUpMsmtGroup(&spiroStreamingGroup);
        }


        // maneuver results
        if (createMsmtGroup(&spiroManeuvGroup, (USES_TIMESTAMP == 1), 8, group_id++)) // 8 msmts for now
        {
            setHeaderRefs(&spiroManeuvGroup, 1);
            if (createNumericMsmt(&fev1, MDC_VOL_AWAY_EXP_FORCED_1S, false, MDC_DIM_L))
            {
                fev1_index = addMetMsmtToGroup(fev1, &spiroManeuvGroup);
            }
            if (createNumericMsmt(&fev6, MDC_VOL_AWAY_EXP_FORCED_6S, false, MDC_DIM_L))
            {
                fev6_index = addMetMsmtToGroup(fev6, &spiroManeuvGroup);
            }
            if (createNumericMsmt(&fvc, MDC_VOL_AWAY_EXP_FORCED_CAPACITY, false, MDC_DIM_L))
            {
                fvc_index = addMetMsmtToGroup(fvc, &spiroManeuvGroup);
            }
            if (createNumericMsmt(&pef, MDC_FLOW_AWAY_EXP_FORCED_PEAK, false, MDC_DIM_L_PER_SEC))
            {
                pef_index = addMetMsmtToGroup(pef, &spiroManeuvGroup);
            }
            if (createNumericMsmt(&fet, MDC_VOL_AWAY_EXP_FORCED_TIME, false, MDC_DIM_SEC))
            {
                fet_index = addMetMsmtToGroup(fet, &spiroManeuvGroup);
            }
            if (createNumericMsmt(&fev1z, MDC_VOL_AWAY_FEV1_Z_SCORE, false, MDC_DIM_DIMLESS))
            {
                fev1z_index = addMetMsmtToGroup(fev1z, &spiroManeuvGroup);
                setMetMsmtSupplementalTypes(&fev1z, 1);  // Reserve space for one supplemental types for prediction equation
                setMetMsmtRefs(&fev1z, 6);
            }
            if (createNumericMsmt(&fev1_lln, MDC_VOL_AWAY_FEV1_LLN, false, MDC_DIM_L))
            {
                fev1_lln_index = addMetMsmtToGroup(fev1_lln, &spiroManeuvGroup);
                setMetMsmtSupplementalTypes(&fev1_lln, 1);  // Reserve space for one supplemental types for prediction equation
                setMetMsmtRefs(&fev1_lln, 5);
            }
            if (createNumericMsmt(&fev1_percent_pred,  MDC_VOL_AWAY_FEV1_PERCENT_PRED, false, MDC_DIM_PERCENT))
            {
                fev1_percent_pred_index = addMetMsmtToGroup(fev1_percent_pred, &spiroManeuvGroup);
                setMetMsmtSupplementalTypes(&fev1_percent_pred, 1);  // Reserve space for one supplemental types for prediction equation
                setMetMsmtRefs(&fev1_percent_pred, 6);
            }
        }

        if (createMsmtGroupDataArray(&msmtGroupSpiroManeuvData, spiroManeuvGroup, sMetTime, PACKET_TYPE_NORMAL))
        {
            updateDataMetMsmtSupplementalTypes(&msmtGroupSpiroManeuvData, fev1z_index, MDC_SPIRO_PRED_EQN_NHANESIII, 0);
            updateDataMetMsmtSupplementalTypes(&msmtGroupSpiroManeuvData, fev1_lln_index, MDC_SPIRO_PRED_EQN_NHANESIII, 0);
            updateDataMetMsmtSupplementalTypes(&msmtGroupSpiroManeuvData, fev1_percent_pred_index, MDC_SPIRO_PRED_EQN_NHANESIII, 0);
        }
        cleanUpMsmtGroup(&spiroManeuvGroup);

        // summary
        // It makes no sense to create this data array here as the number of references will be unknown until
        // the session ends. Then we pick the best 3 best FVC and FEV1 values and use that. Then we fill in
        // the refs which ideally will have up to three entries in addition to the session_id.
        if (createMsmtGroup(&spiroSummaryGroup, (USES_TIMESTAMP == 1), 2, group_id++)) // 1 msmts
        {
            setHeaderRefs(&spiroSummaryGroup, 1);
            if (createCodedMsmt(&fvcAtsGrade, MDC_SPIRO_FVC_ATS_QUAL))
            {
                setMetMsmtRefs(&fvcAtsGrade, 2);
                fvcAtsGrade_index = addMetMsmtToGroup(fvcAtsGrade, &spiroSummaryGroup);
            }
            if (createCodedMsmt(&fev1AtsGrade, MDC_SPIRO_FEV1_ATS_QUAL))
            {
                setMetMsmtRefs(&fev1AtsGrade, 2);            
                fev1AtsGrade_index = addMetMsmtToGroup(fev1AtsGrade, &spiroSummaryGroup);
            }
            createMsmtGroupDataArray(&msmtGroupSpiroSummaryData, spiroSummaryGroup, sMetTime, PACKET_TYPE_NORMAL);
            cleanUpMsmtGroup(&spiroSummaryGroup);
        }

