brianreinhold/NordicPHDs/nRF52/ble_app_met_epoch/handleSpecializations.c
        // session end
        if (createMsmtGroup(&spiroSessionEndGroup, (USES_TIMESTAMP == 1), 1, group_id++)) // 1 msmt
        {
            setHeaderRefs(&spiroSessionEndGroup, 1);
            if (createCodedMsmt(&sessionEnd, MDC_DIAG_SESSION_SPIRO))
            {
                session_end_index = addMetMsmtToGroup(sessionEnd, &spiroSessionEndGroup);
            }
            createMsmtGroupDataArray(&msmtGroupSpiroSessionEndData, spiroSessionEndGroup, sMetTime, PACKET_TYPE_NORMAL);
            cleanUpMsmtGroup(&spiroSessionEndGroup);
        }
    #endif
    
    #if (SCALE == 1)
        s_MsmtGroup *msmtGroup = NULL;          // We will have two groups, a measurement group
        s_MsmtGroup *settingsGroup = NULL;      // and a settings group
        s_MetMsmt *mass = NULL;                 // This structure is used to configure the weight metric
        s_MetMsmt *height = NULL;               // This structure is used to configure the height setting metric
        s_MetMsmt *bmi = NULL;                  // This structure is used to configure the BMI metric

        // Create the msmt data group for the settings measurements, in this case the height.
        result = createMsmtGroup(&settingsGroup,  // The structure containing the group
                                          false,  // no time stamp (I think a setting should have a time stamp indicating when it was set)
                                              1,  // The group shall contain one measurement (the height)
                                     group_id++); // The group id (only used if playing with the optimization scheme)
        result = setHeaderOptions(&settingsGroup, // Set the header options 
                                            true, // Indicates that these measurements are settings
                                            true, // Indicates we will have a person id
                                              2); // This is the value of the person id (ignored if the above is false)
        result = createNumericMsmt(&height,     // Create the height measurement
                       MDC_LEN_BODY_ACTUAL,     // The MDC type code for height
                                     false,     // If true, an SFLOAT (2-byte Mder Float) is used. When false a 4-byte FLOAT is used)
                          MDC_DIM_CENTI_M);     // The MDC unit code which is centimeters.
        height_index = addMetMsmtToGroup(height, &settingsGroup);   // Add the measurement to the settings group. Remember the returned index!
        result = createMsmtGroupDataArray(&settingsGroupData,       // Create the data array template. It will be in this structure
                                               settingsGroup,       // Here is the group to serialize
                                                    sMetTime,       // This is the time stamp information we have. Since we are not using timestamps
                                                                    // in the measurement settings we could pass in NULL
                                          PACKET_TYPE_NORMAL);      // We are sending the simple way (no optimization scheme)
        // The template contains all the static fields. There is space left for the msmt_ids and the value.
        // However, this settings will not change during the connection and we are only going to send it once. So we can populate everything now.
        // Populate the settings measurement data array with the settings height value and msmt_id. This need only be done once
        // unless, for some reason, the setting changes. Here we assume it is not to change while connected.
        s_MderFloat mder;
        mder.mderFloatType = MDER_FLOAT;
        mder.specialValue = MDER_NUMBER;
        mder.exponent = -1;
        mder.mantissa = HEIGHT;
        mder.mderFloatType = MDER_SFLOAT;
        height_ref = msmt_id;               // Save the msmt_id value so the BMI msmts can point to it.
        result = updateDataNumeric(&settingsGroupData,  // Populate the single measurement with the data.
                                         height_index, 
                                                &mder,  // Here is the value to serialize and fill into the template
                                            msmt_id++); // Create final measurement - this is a setting.
        cleanUpMsmtGroup(&settingsGroup); // cleans up any allocated data -  we only need the data array now

        // Create the measurement group for the mass and bmi.
        result = createMsmtGroup(&msmtGroup, (USES_TIMESTAMP == 1), 2, group_id++); // 2 msmts mass, BMI
        result = setHeaderOptions(&msmtGroup, false, true, 2);  // include a person Id
        result = createNumericMsmt(&mass, MDC_MASS_BODY_ACTUAL, false, MDC_DIM_KILO_G); // Create a numeric msmt for the body mass
        mass_index = addMetMsmtToGroup(mass, &msmtGroup);       // add it to the group
        result = createNumericMsmt(&bmi, MDC_RATIO_MASS_BODY_LEN_SQ, false, MDC_DIM_KG_PER_M_SQ); // Create a numeric msmt for the BMI
        result = setMetMsmtRefs(&bmi, 2);              // Make room for two references in the BMI; one to height, the other to mass
        bmi_index = addMetMsmtToGroup(bmi, &msmtGroup);         // add the msmt to the group
        result = createMsmtGroupDataArray(&msmtGroupScaleData, msmtGroup, sMetTime, PACKET_TYPE_NORMAL); // Create the data packet and support info
        cleanUpMsmtGroup(&msmtGroup); // cleans up any allocated data -  we only need the data array now
    #endif  // Ear thermometer
    #if (THERMOMETER == 1)
        // Create the msmt data group 
        s_MsmtGroup *msmtGroup = NULL;
        s_MetMsmt *temp = NULL;
        s_MetMsmt *ambient = NULL;
        result = createMsmtGroup(&msmtGroup, (USES_TIMESTAMP == 1), 2, group_id++); // 2 msmts - body temp & ambient temp
        result = createNumericMsmt(&temp, MDC_TEMP_EAR, false, MDC_DIM_FAHR);
        temp_index = addMetMsmtToGroup(temp, &msmtGroup);
        result = createNumericMsmt(&ambient, MDC_TEMP_ROOM, false, MDC_DIM_FAHR);
        ambient_index = addMetMsmtToGroup(ambient, &msmtGroup);
        result = createMsmtGroupDataArray(&msmtGroupTempData, msmtGroup, sMetTime, PACKET_TYPE_NORMAL);
        cleanUpMsmtGroup(&msmtGroup); // cleans up any allocated data -  we only need the data array now
    #endif  // Ear thermometer
}

/**
 * This method is called indirectly from the main loop via encodeMsmtData method. The first method just checks the
 * bluetooth state/process to see if data is ready to be encoded. In any case, when it get here the data structs containing
 * the data from the sensors have been populated and now we just have to stick them in the data array. Since this method
 * is called by different specializations each requiring their own information, what is queued is void* pointer and size
 * parameter. Here we need to cast the void* to the specialization-specific structure.
 */
bool encodeSpecializationMsmts(s_MsmtData *msmt)
{
    #if (BP_CUFF == 1)

        s_MderFloat mder[3];                            // Since it the Blood Pressure we need to provide the three values
                                                        // obtained from the sensors. This stage is a little tricky, as we
                                                        // need to pass precision information and maintain that throughout the
                                                        // transfer. The IEEE 11073 20601 SFLOAT and FLOATs are used. The
                                                        // library will do this for you but you need to populate an s_MderFloat
                                                        // struct for each value. We can see how that is done below.
        if (!readyToSend()) return false;    // This method initalizes a structure needed for the send
                                                                    // method. This includes the length of the data array
                                                                    // and the characteristic it is to be notified on. The necessary
                                                                    // information is contained in the data array structure msmtGroupBpData.
                                                                    // The structure populated is the s_global_send structure.
                                                                    // Recall that this model is synchronous.
        // Add the command
        msmtGroupBpData->data[0] = (global_send.current_command & 0xFF);        // We need to populate the first two bytes of the data array with
        msmtGroupBpData->data[1] = ((global_send.current_command >> 8) & 0xFF); // the command issued by the client that we are responding to.
                                                                                // In this case the command will be either send stored 
                                                                                // data or send live data.
        mder[0].mderFloatType = MDER_SFLOAT;    // Now to create the Mder Floats. We are using 2-byte SFLOAT
        mder[0].specialValue = MDER_NUMBER;     // This SFLOAT is going to be number versus a special value as a NAN, PINF r NINF
        mder[0].exponent = 0;                   // The exponent of 0 means this is an integer with no decimal precison
        mder[0].mantissa = msmt->systolic;        // This is the mantissa which is this case is the value retrieved from our fake sensors.
                                                // Now if our sensors sent a systolic value with tenths precision, it would probably send
                                                // an integer like 1232 to represent 123.2 since it is much easier to do. Then you would
                                                // enter -1 in the exponent and 1232 in the mantissa. In the end, the value is given by
                                                // mantissa * 10 ** exponent. However, the exponent has a further meaning of precision
                                                // such that one can send either 2, 2.0, 2.00, etc. They are all the same value but indicate
                                                // different sensor precisions.
        mder[1].mderFloatType = MDER_SFLOAT;
        mder[1].specialValue = MDER_NUMBER;
        mder[1].exponent = 0;
        mder[1].mantissa = msmt->diastolic;       // Same as for systolic but for diastolic
        mder[2].mderFloatType = MDER_SFLOAT;
        mder[2].specialValue = MDER_NUMBER;
        mder[2].exponent = 0;
        mder[2].mantissa = msmt->mean;            // Same as for systolic but for mean.

        updateDataMetMsmtRefs(&msmtGroupBpData, // This method may seem a little out of place, but it is to add the references to the
                                                        // bp and pr measurements for the status event. Every MET measurement has a unique
                                                        // instance number over a connection, here given by msmt_id. The current msmt_id value
                                                        // is going to be for the blood pressure measurement coming up so we add that value 
                                                        // here to the status measurement
                                      status_index,     // This status_index states we will add the msmt_id to status measurement reference list.
                                      msmt_id,          // This is the reference instance
                                      0);               // This is the index of the reference we are adding. At the start we allocated space
                                                        // for two reference numbers. Here we are doing the first one. If the number is out of
                                                        // bounds it wont get added.

        updateDataCompound(&msmtGroupBpData,    // Now we update the data array with the blood pressure values. The method expects the
                                                // measurement to be updated to be the configured compound thus 'updateDataCOMPOUND'
                           bp_index,            // The bp_index indicates that the value update is to be done to the blood pressure. The
                                                // method will check that the measurement is, in fact, a compound.
                           mder,                // This is the array of s_MderFloats containing the bp values with their precision
                           msmt_id++);          // This is the instance number for the bp measurement. We increment msmt_id to use in the
                                                // next measurement
        mder[0].mantissa = msmt->pulseRate;       // Now for the pulse rate. We will reuse the first of our s_MderFloats. All the supporting
                                                // parameters are the same. We need only set the mantissa.

        updateDataMetMsmtRefs(&msmtGroupBpData, status_index, msmt_id, 1); // Now since the current msmt_id is going to be the instance
                                                                                   // number for the pulse rate, we add that value to the status
                                                                                   // measurement reference list. But it is now the second entry.
        updateDataNumeric(&msmtGroupBpData,     // Now we update the pulse rate in the data array which is a numeric
                          pr_index,             // Tells the updater which measurement in the group the pulse rate is
                          &mder[0],             // The value of the pulse rate with precision
                          msmt_id++);           // The instance number for the pulse rate which is then incremented.
        if (msmt->hasStatus)
        {
            // The initial data array is created with the status measurement in it. The question is are we going to send it?
            // If we have status data, assure that we are going to send it. So if we are currently configured such that
            // we are not sending the last measurement, here we make sure we are. The reverse is true if there is no status.
            if (getNumberOfMeasurementsDropped(&msmtGroupBpData) == 1)  // Status is needed but it has been dropped
            {
                updateDataRestoreLastMsmt(&msmtGroupBpData);                                // Restore it in the group
            }
            updateDataBits(&msmtGroupBpData,    // Now we update the status measurement which is a 16-bit event/state measurement
                                                // Note we could check that the status flags are all zero. In that case we simply
                                                // could skip sending this measurement. But in this demo we are just toggle between
                                                // sending the status and not sending it. Our fake data generator always generate status
                                                // values. Hopefully a real device won't send status events all the time.
                         status_index,                      // This status_index indicates that these updates are for the status measurement
                         (msmt->status_cuff_too_loose         // These are the possible status flags that could have been set in our bp measurement.
                        | msmt->status_improper_position
                        | msmt->status_irregular_pulse
                        | msmt->status_movement),
                         msmt_id++);             // The instance number for the sensor status which is then incremented.
        }
        else if (getNumberOfMeasurementsDropped(&msmtGroupBpData) == 0)    // No status but it is present
        {
            updateDataDropLastMsmt(&msmtGroupBpData);                                           // Drop it from the group
        }
        if (msmt->hasTimeStamp)
        {
            updateTimeStampEpoch(&msmtGroupBpData, msmt->sMetTime.epoch);  // Now we call the update method to populate the time stamp. In our fake
                                                                         // data generator we get the current clock tick, add it to the base-epoch
                                                                         // and place that into the bp measurement structure.
            updateTimeStampTimeline(&msmtGroupBpData,   // In this app so far a change in the timeline will only happen for stored data.
               msmt->sMetTime.flagUnknownTimeline);       // when the DK powercycles. The timeline of the stored data will be lost
                                                          // This method will capture the time line change.
        }
        if (!prepareMeasurements(msmtGroupBpData)) return false;
        NRF_LOG_DEBUG("Bp msmt to send");       // Now we have the data array to send to the client. In the main for-loop the send-Flag has been
                                                // set which will cause this data to be sent.
    #endif
    #if (PULSE_OX == 1)
        s_MderFloat mder;
        mder.mderFloatType = MDER_SFLOAT;
        mder.specialValue = MDER_NUMBER;
        if (msmt->isContinuous)
        {
            #if (SEND_OPTIMIZED == 1)
                s_MsmtGroupData *bytes = first_cont_sent ? msmtGroupOptimizedContData : msmtGroupContData;
            #else
                s_MsmtGroupData *bytes = msmtGroupContData;
            #endif
            if (!prepareMeasurements(bytes)) return false;
            // Add the command
            bytes->data[0] = (global_send.current_command & 0xFF);
            bytes->data[1] = ((global_send.current_command >> 8) & 0xFF);
            mder.exponent = 0;
            mder.mantissa = msmt->spo2;
            updateDataNumeric(&bytes, spo2_cont_index, &mder, msmt_id++);
            mder.mantissa = msmt->pulseRate;
            updateDataNumeric(&bytes, pr_cont_index, &mder, msmt_id++);
            mder.mantissa = msmt->pulseQuality;
            mder.exponent = -2;
            updateDataNumeric(&bytes, qual_cont_index, &mder, msmt_id++);
            NRF_LOG_DEBUG("Continuous msmt to send");
        }
        else
        {
            if (!prepareMeasurements(msmtGroupSpotData)) return false;
            // Add the command
            msmtGroupSpotData->data[0] = (global_send.current_command & 0xFF);
            msmtGroupSpotData->data[1] = ((global_send.current_command >> 8) & 0xFF);

            mder.exponent = 0;
            mder.mantissa = msmt->spo2;
            updateDataNumeric(&msmtGroupSpotData, spo2_index, &mder, msmt_id++);
            mder.mantissa = msmt->pulseRate;
            updateDataNumeric(&msmtGroupSpotData, pr_index, &mder, msmt_id++);
            mder.mantissa = msmt->pulseQuality;
            mder.exponent = -2;
            updateDataNumeric(&msmtGroupSpotData, qual_index, &mder, msmt_id++);
            NRF_LOG_DEBUG("Spot msmt to send");
            updateTimeStampEpoch(&msmtGroupSpotData, msmt->sMetTime.epoch);
            updateTimeStampTimeline(&msmtGroupSpotData,    // In this app so far a change in the timeline will only happen for stored data.
                msmt->sMetTime.flagUnknownTimeline);       // when the DK powercycles. The timeline of the stored data will be lost
                                                           // This method will capture the time line change.

