brianreinhold/NordicPHDs/nRF52/ble_app_met_epoch/handleSpecializations.c
        }
    #endif
    #if (GLUCOSE == 1)
        s_MderFloat mder;
        if (!prepareMeasurements(msmtGroupGlucData)) return false;
        // Add the command
        msmtGroupGlucData->data[0] = (global_send.current_command & 0xFF);
        msmtGroupGlucData->data[1] = ((global_send.current_command >> 8) & 0xFF);
        mder.mderFloatType = MDER_SFLOAT;
        mder.specialValue = MDER_NUMBER;
        mder.exponent = -1;
        mder.mantissa = msmt->conc;
        mder.mderFloatType = MDER_SFLOAT;
        unsigned short ref = msmt_id;
        updateDataNumeric(&msmtGroupGlucData, conc_index, &mder, msmt_id++);
        updateDataMetMsmtSupplementalTypes(&msmtGroupGlucData, conc_index, msmt->meal_context, 0);
        updateDataMetMsmtSupplementalTypes(&msmtGroupGlucData, conc_index, msmt->body_site, 1);
        updateDataMetMsmtSupplementalTypes(&msmtGroupGlucData, conc_index, msmt->health, 2);
        updateDataMetMsmtSupplementalTypes(&msmtGroupGlucData, conc_index, msmt->tester, 3);
        mder.exponent = 0;
        mder.mantissa = msmt->carbs;
        updateDataNumeric(&msmtGroupGlucData, carbs_index, &mder, msmt_id++);
        updateDataMetMsmtSupplementalTypes(&msmtGroupGlucData, carbs_index, msmt->carbs_type, 0);
        mder.exponent = -1;
        mder.mantissa = msmt->meds;
        updateDataNumeric(&msmtGroupGlucData, meds_index, &mder, msmt_id++);
        updateDataMetMsmtSupplementalTypes(&msmtGroupGlucData, meds_index, msmt->medication_type, 0);
        mder.exponent = 0;
        mder.mantissa = msmt->exer;
        updateDataNumeric(&msmtGroupGlucData, exer_index, &mder, msmt_id++);
        updateTimeStampEpoch(&msmtGroupGlucData, msmt->sMetTime.epoch);
        updateTimeStampTimeline(&msmtGroupGlucData,    // In this app so far a change in the timeline will only happen for stored data.
            msmt->sMetTime.flagUnknownTimeline);       // when the DK powercycles. The timeline of the stored data will be lost
                                                       // This method will capture the time line change.
        NRF_LOG_DEBUG("Bp msmt to send");
    #endif
    #if (HEART_RATE == 1)
        s_MderFloat mder;
        #if (SEND_OPTIMIZED == 1)
            s_MsmtGroupData *bytes = first_cont_sent ? msmtGroupHrOptimizedData : msmtGroupHrData;
        #else
            s_MsmtGroupData *bytes = msmtGroupHrData;
        #endif
        if (!prepareMeasurements(bytes)) return false;
        // Add the command
        bytes->data[0] = (global_send.current_command & 0xFF);
        bytes->data[1] = ((global_send.current_command >> 8) & 0xFF);
        mder.mderFloatType = MDER_SFLOAT;
        mder.specialValue = MDER_NUMBER;
        mder.exponent = 0;
        mder.mantissa = msmt->heartRate;
        mder.mderFloatType = MDER_SFLOAT;
        #if (USES_TIMESTAMP == 1)
            updateTimeStampEpoch(&bytes, msmt->sMetTime.epoch);
        #endif
        updateDataNumeric(&bytes, hr_index, &mder, msmt_id++);
    #endif
    // We are not generating the measurements on the fly as in the other cases, it is all pre done
    // except for the time stamps.
    #if (SPIROMETER == 1)
        s_MsmtData *session = msmt;
        if (spiro_sequence == 0)
        {
            if (!prepareMeasurements(msmtGroupSpiroSessionData))
            {
                spiro_sequence++;
                return false;
            }
            // Add the command
            msmtGroupSpiroSessionData->data[0] = (global_send.current_command & 0xFF);
            msmtGroupSpiroSessionData->data[1] = ((global_send.current_command >> 8) & 0xFF);
            NRF_LOG_DEBUG("Sending Spirometer session");
            updateTimeStampEpoch(&msmtGroupSpiroSessionData, session->sMetTime.epoch);
            msmt_id = 1;  // resetting the msmt id because the session end updates it
            updateDataCoded(&msmtGroupSpiroSessionData, session_index, MDC_START, msmt_id);
            msmt_id = 7;    // Skip to 7 for the pre-set settings ids
          //  updateDataCoded(&msmtGroupSpiroSessionData, session_index, MDC_DIAG_SPIRO_TEST, msmt_id++);
        }
        if (spiro_sequence == 1)
        {
            if (!prepareMeasurements(msmtGroupSpiroSettingsData))
            {
                spiro_sequence++;
                return false;
            }
            // Add the command
            msmtGroupSpiroSettingsData->data[0] = (global_send.current_command & 0xFF);
            msmtGroupSpiroSettingsData->data[1] = ((global_send.current_command >> 8) & 0xFF);
            updateTimeStampEpoch(&msmtGroupSpiroSettingsData, session->sMetTime.epoch);
            NRF_LOG_DEBUG("Sending Spirometer settings");
        }
        else if (spiro_sequence == 2)
        {
            if (!prepareMeasurements(msmtGroupSpiroSubSessionData))
            {
                spiro_sequence++;
                return false;
            }
            // Add the command
            msmtGroupSpiroSubSessionData->data[0] = (global_send.current_command & 0xFF);
            msmtGroupSpiroSubSessionData->data[1] = ((global_send.current_command >> 8) & 0xFF);
            updateDataHeaderRefs(&msmtGroupSpiroSubSessionData, session_id, 0);
            NRF_LOG_DEBUG("Sending first maneuver Spirometer sub session");
            updateTimeStampEpoch(&msmtGroupSpiroSubSessionData, session->sMetTime.epoch);
            sub_session_id = msmt_id;
            updateDataCoded(&msmtGroupSpiroSubSessionData, sub_session_index, MDC_START, msmt_id++);
        }
        else if (spiro_sequence == 3)
        {
            NRF_LOG_INFO("Sending Spirometer flow and volume streams 1");
            if (!prepareMeasurements(msmtGroupSpiroStreamData))
            {
                spiro_sequence++;
                return false;
            }
            // Add the command
            msmtGroupSpiroStreamData->data[0] = (global_send.current_command & 0xFF);
            msmtGroupSpiroStreamData->data[1] = ((global_send.current_command >> 8) & 0xFF);
            updateTimeStampEpoch(&msmtGroupSpiroStreamData, session->sMetTime.epoch);
            updateDataHeaderRefs(&msmtGroupSpiroStreamData, sub_session_id, 0);
            updateDataRtsa(&msmtGroupSpiroStreamData, flow_index, flowBytes, NO_OF_SAMPLES * SAMPLE_SIZE, msmt_id++);
        }
        else if (spiro_sequence == 4)
        {
            NRF_LOG_INFO("Sending Spirometer flow and volume streams 2");
            if (!prepareMeasurements(msmtGroupSpiroStreamData))
            {
                spiro_sequence++;
                return false;
            }
            // Add the command
            msmtGroupSpiroStreamData->data[0] = (global_send.current_command & 0xFF);
            msmtGroupSpiroStreamData->data[1] = ((global_send.current_command >> 8) & 0xFF);
            updateTimeStampEpoch(&msmtGroupSpiroStreamData, session->sMetTime.epoch);
            updateDataHeaderRefs(&msmtGroupSpiroStreamData, sub_session_id, 0);
            updateDataRtsa(&msmtGroupSpiroStreamData, flow_index, &flowBytes[NO_OF_SAMPLES * SAMPLE_SIZE], NO_OF_SAMPLES * SAMPLE_SIZE, msmt_id++);
        }
        else if (spiro_sequence == 5)
        {
            if (!prepareMeasurements(msmtGroupSpiroManeuvData))
            {
                spiro_sequence++;
                return false;
            }
            // Add the command
            msmtGroupSpiroManeuvData->data[0] = (global_send.current_command & 0xFF);
            msmtGroupSpiroManeuvData->data[1] = ((global_send.current_command >> 8) & 0xFF);
            NRF_LOG_DEBUG("Sending Spirometer Maneuver data");
            updateTimeStampEpoch(&msmtGroupSpiroManeuvData, session->sMetTime.epoch);
            updateDataHeaderRefs(&msmtGroupSpiroManeuvData, sub_session_id, 0);
            s_MderFloat mder;
            mder.exponent = -3;
            mder.mantissa = fev1Val;
            mder.mderFloatType = MDER_FLOAT;
            mder.specialValue = MDER_NUMBER;
            fev1_ids[fev1_id_index] = msmt_id;
            updateDataNumeric(&msmtGroupSpiroManeuvData, fev1_index, &mder, msmt_id++);
            mder.mantissa = fev6Val;
            updateDataNumeric(&msmtGroupSpiroManeuvData, fev6_index, &mder, msmt_id++);
            mder.mantissa = fvcVal;
            fvc_ids[fvc_id_index] = msmt_id;
            updateDataNumeric(&msmtGroupSpiroManeuvData, fvc_index, &mder, msmt_id++);
            mder.mantissa = pefVal;
            updateDataNumeric(&msmtGroupSpiroManeuvData, pef_index, &mder, msmt_id++);
            mder.mantissa = fetVal;
            updateDataNumeric(&msmtGroupSpiroManeuvData, fet_index, &mder, msmt_id++);
            mder.mantissa = fev1z_val;
            updateDataNumeric(&msmtGroupSpiroManeuvData, fev1z_index, &mder, msmt_id++);
            updateDataMetMsmtRefs(&msmtGroupSpiroManeuvData, fev1z_index, fev1_ids[fev1_id_index], 0);
            updateDataMetMsmtRefs(&msmtGroupSpiroManeuvData, fev1z_index, settings_id[0], 1);
            updateDataMetMsmtRefs(&msmtGroupSpiroManeuvData, fev1z_index, settings_id[1], 2);
            updateDataMetMsmtRefs(&msmtGroupSpiroManeuvData, fev1z_index, settings_id[2], 3);
            updateDataMetMsmtRefs(&msmtGroupSpiroManeuvData, fev1z_index, settings_id[3], 4);
            updateDataMetMsmtRefs(&msmtGroupSpiroManeuvData, fev1z_index, settings_id[4], 5);
            mder.mantissa = fev1_lln_val;
            updateDataNumeric(&msmtGroupSpiroManeuvData, fev1_lln_index, &mder, msmt_id++);
            updateDataMetMsmtRefs(&msmtGroupSpiroManeuvData, fev1_lln_index, settings_id[0], 0);
            updateDataMetMsmtRefs(&msmtGroupSpiroManeuvData, fev1_lln_index, settings_id[1], 1);
            updateDataMetMsmtRefs(&msmtGroupSpiroManeuvData, fev1_lln_index, settings_id[2], 2);
            updateDataMetMsmtRefs(&msmtGroupSpiroManeuvData, fev1_lln_index, settings_id[3], 3);
            updateDataMetMsmtRefs(&msmtGroupSpiroManeuvData, fev1_lln_index, settings_id[4], 4);
            mder.mantissa = fev1_percent_pred_val;
            mder.exponent = -1;
            updateDataNumeric(&msmtGroupSpiroManeuvData, fev1_percent_pred_index, &mder, msmt_id++);
            updateDataMetMsmtRefs(&msmtGroupSpiroManeuvData, fev1_percent_pred_index, fev1_ids[fev1_id_index], 0);
            updateDataMetMsmtRefs(&msmtGroupSpiroManeuvData, fev1_percent_pred_index, settings_id[0], 1);
            updateDataMetMsmtRefs(&msmtGroupSpiroManeuvData, fev1_percent_pred_index, settings_id[1], 2);
            updateDataMetMsmtRefs(&msmtGroupSpiroManeuvData, fev1_percent_pred_index, settings_id[2], 3);
            updateDataMetMsmtRefs(&msmtGroupSpiroManeuvData, fev1_percent_pred_index, settings_id[3], 4);
            updateDataMetMsmtRefs(&msmtGroupSpiroManeuvData, fev1_percent_pred_index, settings_id[4], 5);
            fev1_id_index++;
            fvc_id_index++;
        }
        else if (spiro_sequence == 6)
        {
            if (!prepareMeasurements(msmtGroupSpiroSubSessionData))
            {
                spiro_sequence++;
                return false;
            }
            // Add the command
            msmtGroupSpiroSubSessionData->data[0] = (global_send.current_command & 0xFF);
            msmtGroupSpiroSubSessionData->data[1] = ((global_send.current_command >> 8) & 0xFF);
            NRF_LOG_DEBUG("Sending first maneuver Spirometer sub session End");
            updateDataHeaderRefs(&msmtGroupSpiroSubSessionData, sub_session_id, 0);
            updateTimeStampEpoch(&msmtGroupSpiroSubSessionData, session->sMetTime.epoch);
            updateDataCoded(&msmtGroupSpiroSubSessionData, sub_session_index, MDC_END, msmt_id++);
        }
        else if (spiro_sequence == 7)
        {
            if (!prepareMeasurements(msmtGroupSpiroSummaryData))
            {
                spiro_sequence++;
                return false;
            }
            // Add the command
            msmtGroupSpiroSummaryData->data[0] = (global_send.current_command & 0xFF);
            msmtGroupSpiroSummaryData->data[1] = ((global_send.current_command >> 8) & 0xFF);
            NRF_LOG_DEBUG("Sending Spirometer summary data");
            updateTimeStampEpoch(&msmtGroupSpiroSummaryData, session->sMetTime.epoch);
            updateDataHeaderRefs(&msmtGroupSpiroSummaryData, session_id, 0);
            updateDataCoded(&msmtGroupSpiroSummaryData, fvcAtsGrade_index, fvcAtsGradeVal, msmt_id++);
            updateDataCoded(&msmtGroupSpiroSummaryData, fev1AtsGrade_index, fev1AtsGradeVal, msmt_id++);
            updateDataMetMsmtRefs(&msmtGroupSpiroSummaryData, fvcAtsGrade_index, fvc_ids[0], 0);
            updateDataMetMsmtRefs(&msmtGroupSpiroSummaryData, fvcAtsGrade_index, fev1_ids[0], 1);
            updateDataMetMsmtRefs(&msmtGroupSpiroSummaryData, fev1AtsGrade_index, fev1_ids[0], 0);
            updateDataMetMsmtRefs(&msmtGroupSpiroSummaryData, fev1AtsGrade_index, fvc_ids[0], 1);
        }
        if (spiro_sequence == 8)
        {
            if (!prepareMeasurements(msmtGroupSpiroSessionEndData))
            {
                spiro_sequence++;
                return false;
            }
            // Add the command
            msmtGroupSpiroSessionEndData->data[0] = (global_send.current_command & 0xFF);
            msmtGroupSpiroSessionEndData->data[1] = ((global_send.current_command >> 8) & 0xFF);
            NRF_LOG_DEBUG("Sending Spirometer session end");
            updateDataHeaderRefs(&msmtGroupSpiroSessionEndData, session_id, 0);
            updateTimeStampEpoch(&msmtGroupSpiroSessionEndData, session->sMetTime.epoch);
            updateDataCoded(&msmtGroupSpiroSessionEndData, session_end_index, MDC_END, msmt_id++);
        }
        if (spiro_sequence == 9)
        {
            ble_disconnected_handler(NULL);
        }
        spiro_sequence++;
    #endif
    #if (THERMOMETER == 1)
        if (!prepareMeasurements(msmtGroupTempData)) return false;
        // Add the command
        msmtGroupTempData->data[0] = (global_send.current_command & 0xFF);
        msmtGroupTempData->data[1] = ((global_send.current_command >> 8) & 0xFF);
        s_MderFloat mder;
        mder.mderFloatType = MDER_FLOAT;
        mder.specialValue = MDER_NUMBER;
        mder.exponent = -2;
        mder.mantissa = msmt->temp;
        updateDataNumeric(&msmtGroupTempData, temp_index, &mder, msmt_id++);
        mder.exponent = -2;
        mder.mantissa = msmt->ambient;
        updateDataNumeric(&msmtGroupTempData, ambient_index, &mder, msmt_id++);
        updateTimeStampEpoch(&msmtGroupTempData, msmt->sMetTime.epoch);
        updateTimeStampTimeline(&msmtGroupTempData,   // In this app so far a change in the timeline will only happen for stored data.
            msmt->sMetTime.flagUnknownTimeline);      // when the DK powercycles. The timeline of the stored data will be lost
                                                      // This method will capture the time line change.
        NRF_LOG_DEBUG("Temperature msmt to send");
    #endif  // Ear thermometer
    #if (SCALE == 1)
        if (scale_sequence > 0)
        {
            if (!prepareMeasurements(msmtGroupScaleData)) return false;
            // Add the command
            msmtGroupScaleData->data[0] = (global_send.current_command & 0xFF);
            msmtGroupScaleData->data[1] = ((global_send.current_command >> 8) & 0xFF);
            s_MderFloat mder;
            mder.mderFloatType = MDER_FLOAT;
            mder.specialValue = MDER_NUMBER;
            mder.exponent = -2;
            mder.mantissa = msmt->mass;
            updateDataMetMsmtRefs(&msmtGroupScaleData, bmi_index, msmt_id, 0);      // Add the references, this is the body mass
            updateDataMetMsmtRefs(&msmtGroupScaleData, bmi_index, height_ref, 1);   // and this is the height
            updateDataNumeric(&msmtGroupScaleData, mass_index, &mder, msmt_id++);
            unsigned long bmi = (unsigned long)msmt->mass;
            unsigned long div = HEIGHT * HEIGHT / 100;
            bmi = (bmi) * 10000 /div; // kg/m*m    mass * 100 *100 / (mm * mm )
            mder.mantissa = bmi;
            updateDataNumeric(&msmtGroupScaleData, bmi_index, &mder, msmt_id++);
            updateTimeStampEpoch(&msmtGroupScaleData, msmt->sMetTime.epoch);
            updateTimeStampTimeline(&msmtGroupScaleData,  // In this app so far a change in the timeline will only happen for stored data.
                msmt->sMetTime.flagUnknownTimeline);      // when the DK powercycles. The timeline of the stored data will be lost
                                                          // This method will capture the time line change.
            NRF_LOG_DEBUG("Weight msmt to send with mass %lu div %lu bmi %lu", msmt->mass, div, bmi);
        }
        else
        {
            if (!prepareMeasurements(settingsGroupData)) return false;
            // Add the command
            settingsGroupData->data[0] = (global_send.current_command & 0xFF);
            settingsGroupData->data[1] = ((global_send.current_command >> 8) & 0xFF);
            NRF_LOG_DEBUG("Weight Scale Height settings msmt to send");
            scale_sequence++;
        }
    #endif
    return true;
}

/**
 * This method generates fake 'live' data. The method is signaled periodically with a timer. The
 * current time stamp is used to generate the fake data. The fake data is stored in the respective
 * structs for the specialization. After this method is called the specialization struct is placed
 * in the queue and then dequeued in the main loop. At that point the struct is passed to the 
 * encoder which populates the data array which is then sent.
 *
 * The timer is set to trigger at a rapid rate so this method is skipped if the previous data has
 * not yet been sent. 
 *
 * No live data is generated for the Glucose meter and the Spirometer. The Spirometer data has a 
 * complex relation to one another so it is all preloaded and thus every run of the spirometer gives
 * exactly the same results (except for the time stamp).
 *
 * This method exists as we have no sensor to feed us real data. This method would be replaced by sensor
 * data coming from an MCU via an interrupt or event while connected.
 */
void generateLiveDataForSpecializations(unsigned long live_data_count, unsigned long long timeStampMsmt, unsigned long timeStamp)
{
    #if (BP_CUFF == 1)
        #define LIVE_COUNT_MAX 64
        if ((live_data_count & 0x0F) == 0x00)
        {
            s_MsmtData bpMsmt;
            unsigned short rand = (timeStamp / 7);
            memset(&bpMsmt, 0, sizeof(s_MsmtData));
            bpMsmt.systolic = 100 + (rand & 0x0F);
            bpMsmt.diastolic = 55 + (rand & 0x0F);
            bpMsmt.mean = ((bpMsmt.systolic + bpMsmt.diastolic) >> 1);
            bpMsmt.hasStatus = ((bpMsmt.systolic & 0x01) == 1);
            bpMsmt.pulseRate = 40 + (rand & 0x07);
            bpMsmt.hasTimeStamp = true;
            bpMsmt.sMetTime.epoch = epoch + timeStampMsmt;
            bpMsmt.sMetTime.clockType = sMetTime->clockType;
            bpMsmt.sMetTime.clockResolution = sMetTime->clockResolution;
            bpMsmt.sMetTime.offsetShift = sMetTime->offsetShift;
            bpMsmt.sMetTime.timeSync = sMetTime->timeSync;
            unsigned short stat = ((timeStamp & 0x1FB) << 7);
            bpMsmt.status_cuff_too_loose = (stat & BP_STATUS_CUFF_TOO_LOOSE);
            bpMsmt.status_improper_position = (stat & BP_STATUS_IMPROPER_POSITION);
            bpMsmt.status_irregular_pulse = (stat & BP_STATUS_IRREGULAR_PULSE);
            bpMsmt.status_movement = (stat & BP_STATUS_MOVEMENT);
            NRF_LOG_INFO("Measurement added to queue: sys %u, dia %u, mean %u, PR %u, status: %u", 
                bpMsmt.systolic,
                bpMsmt.diastolic,
                bpMsmt.mean,
                bpMsmt.pulseRate,
                bpMsmt.hasStatus);
            if(sd_mutex_acquire(&q_mutex) != NRF_ERROR_SOC_MUTEX_ALREADY_TAKEN)
            {
                enqueue(queue, &bpMsmt, sizeof(s_MsmtData));
                sd_mutex_release(&q_mutex);
            }
        }
        else
        {
            return;
        }
    #endif
    
    #if (PULSE_OX == 1)
        s_MsmtData poMsmt;
        memset(&poMsmt, 0, sizeof(s_MsmtData));
        poMsmt.spo2 = 95 + (timeStamp & 0x03);
        poMsmt.pulseRate = 45 + (timeStamp & 0x07);
        poMsmt.pulseQuality = 523 + (timeStamp & 0xFF);
        if ((live_data_count & 0x0F) == 0x00)
        {
            poMsmt.hasTimeStamp = true;
            poMsmt.sMetTime.epoch = epoch + timeStampMsmt;
            poMsmt.sMetTime.offsetShift = sMetTime->offsetShift;
            poMsmt.sMetTime.timeSync = sMetTime->timeSync;
            NRF_LOG_INFO("Measurement added to queue: spo2 %u, pulse rate %u, pulse quality %u", 
                poMsmt.spo2,
                poMsmt.pulseRate,
                poMsmt.pulseQuality);
            poMsmt.isContinuous = false;
        }
        else
        {
            poMsmt.hasTimeStamp = false;
            poMsmt.isContinuous = true;
        }
        if(sd_mutex_acquire(&q_mutex) != NRF_ERROR_SOC_MUTEX_ALREADY_TAKEN)
        {
            enqueue(queue, &poMsmt, sizeof(s_MsmtData));
            sd_mutex_release(&q_mutex);
        }
    #endif
    #if (HEART_RATE == 1)
        s_MsmtData hrMsmt;
        hrMsmt.hasTimeStamp = (USES_TIMESTAMP == 1);
        if (USES_TIMESTAMP == 1)
        {
            hrMsmt.sMetTime.epoch = epoch + timeStampMsmt;
            hrMsmt.sMetTime.offsetShift = sMetTime->offsetShift;
            hrMsmt.sMetTime.timeSync = sMetTime->timeSync;
        }
        hrMsmt.heartRate = 55 + ((timeStamp >> 9) & 0x07);
        if(sd_mutex_acquire(&q_mutex) != NRF_ERROR_SOC_MUTEX_ALREADY_TAKEN)
        {
            enqueue(queue, &hrMsmt, sizeof(s_MsmtData));
            sd_mutex_release(&q_mutex);
        }
    #endif
    
    #if (SPIROMETER == 1)
        if (spiro_sequence >= 10) return;
        s_MsmtData session;  // Dummy - data is already encoded
        memset(&session, 0, sizeof(s_MsmtData));
        session.sMetTime.epoch = epoch + timeStampMsmt;
        session.sMetTime.offsetShift = sMetTime->offsetShift;
        session.sMetTime.timeSync = sMetTime->timeSync;
        if(sd_mutex_acquire(&q_mutex) != NRF_ERROR_SOC_MUTEX_ALREADY_TAKEN)
        {
            enqueue(queue, &session, sizeof(s_MsmtData));
            sd_mutex_release(&q_mutex);
        }
    #endif
    #if (SCALE == 1)
        s_MsmtData scaleMsmt;
        memset(&scaleMsmt, 0, sizeof(s_MsmtData));
        scaleMsmt.mass = 6800 + (timeStamp & 0xFF);
        scaleMsmt.hasTimeStamp = true;
        scaleMsmt.sMetTime.epoch = epoch + timeStampMsmt;
        scaleMsmt.sMetTime.offsetShift = sMetTime->offsetShift;
        scaleMsmt.sMetTime.timeSync = sMetTime->timeSync;
        NRF_LOG_INFO("Measurement added to queue: weight %u", scaleMsmt.mass);
        if(sd_mutex_acquire(&q_mutex) != NRF_ERROR_SOC_MUTEX_ALREADY_TAKEN)
        {
            if (scale_sequence == 0)
            {
                enqueue(queue, &scaleMsmt, sizeof(s_MsmtData)); // This is to trigger the setting
            }
            enqueue(queue, &scaleMsmt, sizeof(s_MsmtData)); // This is the live measurement
            sd_mutex_release(&q_mutex);
        }
    #endif
    #if (THERMOMETER == 1)
        s_MsmtData tempMsmt;
        memset(&tempMsmt, 0, sizeof(s_MsmtData));
        tempMsmt.temp = 9800 + (timeStamp & 0xFF);
        tempMsmt.ambient = 7200 + (timeStamp & 0x1FF);
        tempMsmt.hasTimeStamp = true;
        tempMsmt.sMetTime.epoch = epoch + timeStampMsmt;
        tempMsmt.sMetTime.offsetShift = sMetTime->offsetShift;
        tempMsmt.sMetTime.timeSync = sMetTime->timeSync;
        NRF_LOG_INFO("Measurement added to queue: body temp %u ambient temp %u", tempMsmt.temp, tempMsmt.ambient);
        if(sd_mutex_acquire(&q_mutex) != NRF_ERROR_SOC_MUTEX_ALREADY_TAKEN)
        {
            enqueue(queue, &tempMsmt, sizeof(s_MsmtData));
            sd_mutex_release(&q_mutex);
        }
    #endif
    // No live data for glucose meter
}

