brianreinhold/NordicPHDs/nRF52/ble_app_met_epoch/handleSpecializations.c
/**
 * This method os called when the device receives a set time command
 */
#if (USES_TIMESTAMP == 1)
void handleSpecializationsOnSetTime(unsigned short numberOfStoredMsmtGroups, long long diff, unsigned short timeSync)
{
    int i;
    unsigned long long udiff = -diff;  // use only when diff < 0
    #if (BP_CUFF == 1)
        updateTimeStampTimeSync(&msmtGroupBpData, timeSync);    // When the device receives a set time in the set time is the
                                                                // synchronization method of the PHG. We update the sync part
                                                                // of the time stamp in the data array, as this will not change
                                                                // The actual time stamp will come from the measurement.
    #endif
    #if (PULSE_OX == 1)
        updateTimeStampTimeSync(&msmtGroupSpotData, timeSync);
    #endif
    #if (HEART_RATE == 1)
        updateTimeStampTimeSync(&msmtGroupHrData, timeSync);
        #if (SEND_OPTIMIZED == 1)
            updateTimeStampTimeSync(&msmtGroupHrOptimizedData, timeSync);
        #endif
    #endif
    #if (SPIROMETER == 1)
        updateTimeStampTimeSync(&msmtGroupSpiroSessionEndData, timeSync);
        updateTimeStampTimeSync(&msmtGroupSpiroStreamData, timeSync);
        updateTimeStampTimeSync(&msmtGroupSpiroManeuvData, timeSync);
        updateTimeStampTimeSync(&msmtGroupSpiroSessionData, timeSync);
        updateTimeStampTimeSync(&msmtGroupSpiroSummaryData, timeSync);
        updateTimeStampTimeSync(&msmtGroupSpiroSubSessionData, timeSync);
    #endif
    #if (SCALE == 1)
        updateTimeStampTimeSync(&msmtGroupScaleData, timeSync);
    #endif
    #if (THERMOMETER == 1)
        updateTimeStampTimeSync(&msmtGroupTempData, timeSync);
    #endif
    // If we have stored data and the time has been set, the timeline has been changed. Here
    // we adjust the time stamps of all our stored data to the new timeline. THat will
    // involve updating the epoch field of the stored time stamp by the difference and
    // and changing the time sync to that specified in the set time.
    #if (USES_STORED_DATA == 1)
        for (i = 0; i < numberOfStoredMsmtGroups; i++)
        {
             if (storedMsmts[i].sMetTime.flagUnknownTimeline != MET_TIME_FLAG_UNKNOWN_TIMELINE)
             {
                 storedMsmts[i].sMetTime.epoch = (diff < 0) ? storedMsmts[i].sMetTime.epoch - udiff  
                            : storedMsmts[i].sMetTime.epoch + diff;
                 storedMsmts[i].sMetTime.timeSync = timeSync;
                 stored_data_same = false;
             }
        }
    #endif
}
#endif

/**
 * This method generates fake data on the push of button 4 on the DK and stores it. There is no
 * stored data option for the Spirometer...it's too hard to generate fake spirometer data that is
 * even close to realistic, especially the waveforms.
 *
 * The fake data are generated from the current time stamp. This method would be replaced with
 * data coming from the sensor MCU interrupt while not connected.
 */
#if (USES_STORED_DATA == 1)
    bool generateAndAddStoredMsmt(unsigned long long timeStampMsmt, unsigned long timeStamp, unsigned short numberOfStoredMsmtGroups)
    {
        #if (BP_CUFF == 1)
                    char buffer[512];
                    memset(buffer, 0, 512);
            storedMsmts[numberOfStoredMsmtGroups].hasTimeStamp = true;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.epoch = epoch + timeStampMsmt;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.clockType = sMetTime->clockType;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.clockResolution = sMetTime->clockResolution;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.offsetShift = sMetTime->offsetShift;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.timeSync = sMetTime->timeSync;
            storedMsmts[numberOfStoredMsmtGroups].systolic = 95 + (timeStamp & 0x0F);
            storedMsmts[numberOfStoredMsmtGroups].diastolic = 55 + (timeStamp & 0x0F);
            storedMsmts[numberOfStoredMsmtGroups].mean = 
                (storedMsmts[numberOfStoredMsmtGroups].systolic +
                 storedMsmts[numberOfStoredMsmtGroups].diastolic) / 2;
            storedMsmts[numberOfStoredMsmtGroups].pulseRate = 40 + (timeStamp & 0x07);
            unsigned short stat = ((timeStamp & 0x1FB) << 7);
            storedMsmts[numberOfStoredMsmtGroups].hasStatus = ((storedMsmts[numberOfStoredMsmtGroups].systolic & 0x01) == 0x01);
            storedMsmts[numberOfStoredMsmtGroups].status_cuff_too_loose = (stat & BP_STATUS_CUFF_TOO_LOOSE);
            storedMsmts[numberOfStoredMsmtGroups].status_improper_position = (stat & BP_STATUS_IMPROPER_POSITION);
            storedMsmts[numberOfStoredMsmtGroups].status_irregular_pulse = (stat & BP_STATUS_IRREGULAR_PULSE);
            storedMsmts[numberOfStoredMsmtGroups].status_movement = (stat & BP_STATUS_MOVEMENT);
            NRF_LOG_INFO("Measurement added: sys %u, dia %u, mean %u, PR %u, timestamp %llu", 
                    storedMsmts[numberOfStoredMsmtGroups].systolic,
                    storedMsmts[numberOfStoredMsmtGroups].diastolic,
                    storedMsmts[numberOfStoredMsmtGroups].mean,
                    storedMsmts[numberOfStoredMsmtGroups].pulseRate, 
                    storedMsmts[numberOfStoredMsmtGroups].sMetTime.epoch);
            return true;
        #endif
        #if (PULSE_OX == 1)
            storedMsmts[numberOfStoredMsmtGroups].hasTimeStamp = true;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.epoch = epoch + timeStampMsmt;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.clockType = sMetTime->clockType;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.clockResolution = sMetTime->clockResolution;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.offsetShift = sMetTime->offsetShift;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.timeSync = sMetTime->timeSync;

