brianreinhold/NordicPHDs/nRF52/ble_app_met_epoch/handleSpecializations.c
            storedMsmts[numberOfStoredMsmtGroups].spo2 = 95 + (timeStamp & 0x03);
            storedMsmts[numberOfStoredMsmtGroups].pulseRate = 45 + (timeStamp & 0x07);
            storedMsmts[numberOfStoredMsmtGroups].pulseQuality = 523 + (timeStamp & 0xFF);

            NRF_LOG_INFO("Measurement added: SpO2 %u%, PR %u, Pulsatile X 100 %u%, timestamp %lu", 
                        storedMsmts[numberOfStoredMsmtGroups].spo2, 
                        storedMsmts[numberOfStoredMsmtGroups].pulseRate, 
                        storedMsmts[numberOfStoredMsmtGroups].pulseQuality, timeStamp);
            return true;
        #endif
        #if (GLUCOSE == 1)

            storedMsmts[numberOfStoredMsmtGroups].hasTimeStamp = true;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.epoch = epoch + timeStampMsmt;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.clockType = sMetTime->clockType;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.clockResolution = sMetTime->clockResolution;        storedMsmts[numberOfStoredMsmtGroups].sMetTime.offsetShift = sMetTime->offsetShift;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.timeSync = sMetTime->timeSync;
            storedMsmts[numberOfStoredMsmtGroups].conc = (95 + (timeStamp & 0x1F)) * 10;
            storedMsmts[numberOfStoredMsmtGroups].body_site = MDC_CTXT_GLU_SAMPLELOCATION_FINGER + (timeStamp & 0x03) * 4;
            storedMsmts[numberOfStoredMsmtGroups].meal_context = MDC_CTXT_GLU_MEAL_PREPRANDIAL + (timeStamp & 0x03) * 4;
            storedMsmts[numberOfStoredMsmtGroups].health = MDC_CTXT_GLU_HEALTH_MINOR + (timeStamp & 0x03) * 4;
            storedMsmts[numberOfStoredMsmtGroups].tester = MDC_CTXT_GLU_TESTER_SELF + (timeStamp & 0x04);
            storedMsmts[numberOfStoredMsmtGroups].carbs = 150 + (timeStamp & 0x7F);
            storedMsmts[numberOfStoredMsmtGroups].carbs_type = MDC_CTXT_GLU_CARB_BREAKFAST + (timeStamp & 0x03) * 4;
            storedMsmts[numberOfStoredMsmtGroups].meds = 100 + (timeStamp & 0x0F); // IU times 10
            storedMsmts[numberOfStoredMsmtGroups].medication_type = MDC_CTXT_MEDICATION_RAPIDACTING + (timeStamp & 0x03) * 4;
            storedMsmts[numberOfStoredMsmtGroups].exer = 60 + (timeStamp & 0x1F);
            NRF_LOG_INFO("Measurement added: conc %u, carbs %u, meds %u, exer %u, timestamp %lu", 
                    storedMsmts[numberOfStoredMsmtGroups].conc,
                    storedMsmts[numberOfStoredMsmtGroups].carbs,
                    storedMsmts[numberOfStoredMsmtGroups].meds,
                    storedMsmts[numberOfStoredMsmtGroups].exer, 
                    timeStamp);
            return true;
        #endif
       #if (SCALE == 1)
            storedMsmts[numberOfStoredMsmtGroups].hasTimeStamp = true;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.epoch = epoch + timeStampMsmt;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.clockType = sMetTime->clockType;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.clockResolution = sMetTime->clockResolution;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.offsetShift = sMetTime->offsetShift;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.timeSync = sMetTime->timeSync;
            storedMsmts[numberOfStoredMsmtGroups].mass = 6800 + (timeStamp & 0xFF);

            NRF_LOG_INFO("Measurement added: Weight %u%, timestamp %lu", 
                storedMsmts[numberOfStoredMsmtGroups].mass, timeStamp);
            return true;
        #endif
        #if (THERMOMETER == 1)
            storedMsmts[numberOfStoredMsmtGroups].hasTimeStamp = true;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.epoch = epoch + timeStampMsmt;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.clockType = sMetTime->clockType;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.clockResolution = sMetTime->clockResolution;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.offsetShift = sMetTime->offsetShift;
            storedMsmts[numberOfStoredMsmtGroups].sMetTime.timeSync = sMetTime->timeSync;
            storedMsmts[numberOfStoredMsmtGroups].temp = 9800 + (timeStamp & 0xFF);
            storedMsmts[numberOfStoredMsmtGroups].ambient = 7200 + (timeStamp & 0x1FF);

            NRF_LOG_INFO("Measurement added: Temperature %u%, ambient temperature %u, timestamp %lu", 
                storedMsmts[numberOfStoredMsmtGroups].temp, storedMsmts[numberOfStoredMsmtGroups].ambient, timeStamp);
            return true;
        #endif
        return false;
        // No stored data generated for Spirometer
    }

    /**
     * This method queues the stored measurement to be sent. In the main loop, the queue is read
     * and if not busy sending data, the send_flag is set and the measurement de-queued.
     */
    void sendStoredSpecializationMsmts(unsigned short stored_count)
    {
        // Set up parameters for notification of this PDU - likely in fragments
        #if (BP_CUFF == 1)
            NRF_LOG_DEBUG("Stored Measurements added to queue: sys %u, dia %u, mean %u, PR %u, count %d", 
                storedMsmts[stored_count].systolic,
                storedMsmts[stored_count].diastolic,
                storedMsmts[stored_count].mean,
                storedMsmts[stored_count].pulseRate,
                stored_count);
            if(sd_mutex_acquire(&q_mutex) != NRF_ERROR_SOC_MUTEX_ALREADY_TAKEN)
            {
                enqueue(queue, &storedMsmts[stored_count], sizeof(s_MsmtData));
                sd_mutex_release(&q_mutex);
            }
        #endif
        #if (PULSE_OX == 1)
            NRF_LOG_DEBUG("Stored Measurements added to queue: spo2 %u, pr %u, qual %u, count %d", 
                storedMsmts[stored_count].spo2,
                storedMsmts[stored_count].pulseRate,
                storedMsmts[stored_count].pulseQuality,
                stored_count);
            if(sd_mutex_acquire(&q_mutex) != NRF_ERROR_SOC_MUTEX_ALREADY_TAKEN)
            {
                enqueue(queue, &storedMsmts[stored_count], sizeof(s_MsmtData));
                sd_mutex_release(&q_mutex);
            }
        #endif
        #if (GLUCOSE == 1)
            NRF_LOG_DEBUG("Stored Measurements added to queue: conc %u, carbs %u, meds %u, exer %u, count %d", 
                storedMsmts[stored_count].conc,
                storedMsmts[stored_count].carbs,
                storedMsmts[stored_count].meds,
                storedMsmts[stored_count].exer,
                stored_count);
            if(sd_mutex_acquire(&q_mutex) != NRF_ERROR_SOC_MUTEX_ALREADY_TAKEN)
            {
                enqueue(queue, &storedMsmts[stored_count], sizeof(s_MsmtData));
                sd_mutex_release(&q_mutex);
            }
        #endif
        #if (SCALE == 1)
            NRF_LOG_DEBUG("Stored Measurements added to queue: mass %u, count %d", 
                storedMsmts[stored_count].mass, stored_count);
            if(sd_mutex_acquire(&q_mutex) != NRF_ERROR_SOC_MUTEX_ALREADY_TAKEN)
            {
              /*  if (scale_sequence == 0)
                {
                    enqueue(queue, &storedMsmts[stored_count], sizeof(s_MsmtDataScale)); // This is to trigger the setting Stored data copied in two places. First one doesnt get sent
                }
                */
                enqueue(queue, &storedMsmts[stored_count], sizeof(s_MsmtData));
                sd_mutex_release(&q_mutex);
            }
        #endif
        #if (THERMOMETER == 1)
            NRF_LOG_DEBUG("Stored Measurements added to queue: temp %u, count %d", 
                storedMsmts[stored_count].temp, stored_count);
            if(sd_mutex_acquire(&q_mutex) != NRF_ERROR_SOC_MUTEX_ALREADY_TAKEN)
            {
                enqueue(queue, &storedMsmts[stored_count], sizeof(s_MsmtData));
                sd_mutex_release(&q_mutex);
            }
        #endif
    }

/**
 * Deletes all the stored data. Called when the PHG sends delete stored data command
 */
    void deleteStoredSpecializationMsmts(void)
    {
        memset(&storedMsmts, 0, NUMBER_OF_STORED_MSMTS * sizeof(s_MsmtData));
        stored_data_same = false;
    }
    
