brianreinhold/NordicPHDs/nRF52/ble_app_met_epoch/handleSpecializations.c
    // This just populates an array with the start and end times of the stored data
    // This is returned in the get number of stored data records command.
    void populate_epoch_range_of_stored_data(unsigned char *epoch_range)
    {
        unsigned long long epoch;
        
        if (numberOfStoredMsmtGroups == 0)
        {
            memset(epoch_range, 0, 12);
            return;
        }
        epoch = storedMsmts[0].sMetTime.epoch;
        sixByteEncode(epoch_range, 0, epoch);
        epoch = storedMsmts[numberOfStoredMsmtGroups - 1].sMetTime.epoch;
        sixByteEncode(epoch_range, 6, epoch);
    }

    void setNotOnCurrentTimeline(void)
    {
        int i;
        for (i = 0; i < numberOfStoredMsmtGroups; i ++)
        {
            storedMsmts[i].sMetTime.flagUnknownTimeline = MET_TIME_FLAG_UNKNOWN_TIMELINE;
            stored_data_same = false;
        }
    }
#endif

void reset_specializations(void)
{
    #if (BP_CUFF == 1)
    #endif

    #if (PULSE_OX == 1)
    #endif
    #if (GLUCOSE == 1)
    #endif
    #if (HEART_RATE == 1)
    #endif
    #if (SPIROMETER == 1)
        spiro_sequence = 0;
    #endif
    #if (SCALE == 1)
        scale_sequence = 0;
    #endif
    #if (THERMOMETER == 1)
    #endif
    #if (USES_TIMESTAMP == 1)
    #endif
}

/**
 * This method frees all the resources taken when we generated the data array structs. This method
 * is called when the device disconnects.
 */
void cleanUpSpecializations(void)
{
    #if (BP_CUFF == 1)
        cleanUpMsmtGroupData(&msmtGroupBpData);
    #endif

    #if (PULSE_OX == 1)
        cleanUpMsmtGroupData(&msmtGroupSpotData);
        cleanUpMsmtGroupData(&msmtGroupContData);
        cleanUpMsmtGroupData(&msmtGroupOptimizedContData);
    #endif
    #if (GLUCOSE == 1)
        cleanUpMsmtGroupData(&msmtGroupGlucData);
    #endif
    #if (HEART_RATE == 1)
        cleanUpMsmtGroupData(&msmtGroupHrData);
    #endif
    #if (SPIROMETER == 1)
        cleanUpMsmtGroupData(&msmtGroupSpiroSessionEndData);
        cleanUpMsmtGroupData(&msmtGroupSpiroSummaryData);
        cleanUpMsmtGroupData(&msmtGroupSpiroManeuvData);
        cleanUpMsmtGroupData(&msmtGroupSpiroStreamData);
        cleanUpMsmtGroupData(&msmtGroupSpiroSubSessionData);
        cleanUpMsmtGroupData(&msmtGroupSpiroSettingsData);
        cleanUpMsmtGroupData(&msmtGroupSpiroSessionData);
    #endif
    #if (SCALE == 1)
        cleanUpMsmtGroupData(&msmtGroupScaleData);
        cleanUpMsmtGroupData(&settingsGroupData);
    #endif
    #if (THERMOMETER == 1)
        cleanUpMsmtGroupData(&msmtGroupTempData);
    #endif
    #if (USES_TIMESTAMP == 1)
        cleanUpMetTime(&sMetTime);
        cleanUpTimeInfoData(&sTimeInfoData);
        cleanUpTimeInfo(&sTimeInfo);
    #endif
     cleanUpSystemInfoData(&systemInfoData);

}
